nguyentri/da-pac/svd/DA14699.svd
<?xml version="1.0" encoding="ascii"?>
<!-- File naming: Dialog_DA1469x.svd -->
<!--
  Copyright (C) 2019 Dialog Semiconductor.
  This computer program includes Confidential, Proprietary Information  
  of Dialog Semiconductor. All Rights Reserved.

  Purpose: System Viewer Description (SVD) Example (Schema Version 1.3)
           This is a description of a none-existent and incomplete device
		   for demonstration purposes only.

  Generated by cmsis-svd (version 0.2), d.d. January 11, 2019 - 14:36:25
 -->
<device xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" schemaVersion="1.3" xs:noNamespaceSchemaLocation="CMSIS-SVD.xsd">
  <vendor>Dialog</vendor>                   				    <!-- device vendor name -->
  <vendorID>ARM</vendorID>                                        <!-- device vendor short name -->
  <name>DA1469x</name>                                          <!-- name of part-->
  <series>DA1469x</series>                                         <!-- device series the device belongs to -->
  <version>1.2</version>                                          <!-- version of this description, adding CMSIS-SVD 1.1 tags -->
  <description>690</description>
  <licenseText><!-- this license text will appear in header file. \n forces line breaks -->
  Copyright (C) 2019 Dialog Semiconductor.\n
  This computer program includes Confidential, Proprietary Information  \n
  of Dialog Semiconductor. All Rights Reserved.
</licenseText>
  <cpu><!-- details about the cpu embedded in the device (SVD version 1.2,  see https://www.keil.com/pack/doc/CMSIS/SVD/html/group__cpu_section__gr.html) -->
    <name>CM33</name>
    <revision>r1p0</revision>
    <endian>little</endian>
    <mpuPresent>false</mpuPresent>
    <fpuPresent>true</fpuPresent>
    <nvicPrioBits>3</nvicPrioBits>
    <vendorSystickConfig>false</vendorSystickConfig>
		
  </cpu>
  <addressUnitBits>8</addressUnitBits>                            <!-- byte addressable memory -->
  <width>32</width>                                               <!-- bus width is 32 bits -->
  <!-- default settings implicitly inherited by subsequent sections -->
  <size>32</size>                                                 <!-- this is the default size (number of bits) of all peripherals
																																									 and register that do not define "size" themselves -->
  <access>read-write</access>                                     <!-- default access permission for all subsequent registers -->
  <resetValue>0x00000000</resetValue>                             <!-- by default all bits of the registers are initialized to 0 on reset -->
  <resetMask>0xFFFFFFFF</resetMask>                               <!-- by default all 32Bits of the registers are used -->
	
  <peripherals>
	<peripheral>
<name>SAU</name>
<version>1.0</version>
<description>Security Attribution Unit</description>
<groupName>SAU</groupName>
<baseAddress>0xE000EDD0</baseAddress>
<size>32</size>
<access>read-write</access>

<addressBlock>
<offset>0</offset>
<size>0x20</size>
<usage>registers</usage>
</addressBlock>

<registers>
<!-- CTRL: Control Register -->
<register>
<name>CTRL</name>
<description>Control Register</description>
<addressOffset>0x00</addressOffset>
<fields>
<!-- EN: Enable -->
<field>
<name>ENABLE</name>
<description>Enable</description>
<bitRange>[0:0]</bitRange>
<enumeratedValues>
<enumeratedValue>
<name>Disable</name>
<description>SAU is disabled</description>
<value>0</value>
</enumeratedValue>
<enumeratedValue>
<name>Enable</name>
<description>SAU is enabled</description>
<value>1</value>
</enumeratedValue>
</enumeratedValues>
</field>

<!-- RST: Reset -->
<field>
<name>ALLNS</name>
<description>Security attribution if SAU disabled</description>
<bitRange>[1:1]</bitRange>
<enumeratedValues>
<enumeratedValue>
<name>Secure</name>
<description>Memory is marked as secure</description>
<value>0</value>
</enumeratedValue>
<enumeratedValue>
<name>Non_Secure</name>
<description>Memory is marked as non-secure</description>
<value>1</value>
</enumeratedValue>
</enumeratedValues>
</field>
</fields>
</register>

<!-- TYPE: -->
<register>
<name>TYPE</name>
<description>Type Register</description>
<addressOffset>0x04</addressOffset>
<access>read-only</access>
<fields>
<!-- SREGION: -->
<field>
<name>SREGION</name>
<description>Number of implemented SAU regions</description>
<bitRange>[7:0]</bitRange>
</field>
</fields>
</register>

<!-- RNR: -->
<register>
<name>RNR</name>
<description>Region Number Register</description>
<addressOffset>0x08</addressOffset>
<fields>
<!-- REGION: -->
<field>
<name>REGION</name>
<description>Currently selected SAU region</description>
<bitRange>[7:0]</bitRange>
<enumeratedValues>
<enumeratedValue>
<name>SAU_Region_0</name>
<description>Select SAU Region 0</description>
<value>0</value>
</enumeratedValue>
<enumeratedValue>
<name>SAU_Region_1</name>
<description>Select SAU Region 1</description>
<value>1</value>
</enumeratedValue>
<enumeratedValue>
<name>SAU_Region_2</name>
<description>Select SAU Region 2</description>
<value>2</value>
</enumeratedValue>
<enumeratedValue>
<name>SAU_Region_3</name>
<description>Select SAU Region 3</description>
<value>3</value>
</enumeratedValue>
</enumeratedValues>
</field>
</fields>
</register>

<!-- RBAR: -->
<register>
<name>RBAR</name>
<description>Region Base Address Register</description>
<addressOffset>0x0C</addressOffset>
<fields>
<!-- BADDR: -->
<field>
<name>BADDR</name>
<description>Base Address</description>
<bitRange>[31:5]</bitRange>
</field>
</fields>
</register>

<!-- RBAR: -->
<register>
<name>RLAR</name>
<description>Region Limit Address Register</description>
<addressOffset>0x10</addressOffset>
<fields>
<!-- LADDR: -->
<field>
<name>LADDR</name>
<description>Limit Address</description>
<bitRange>[31:5]</bitRange>
</field>
<!-- NSC: -->
<field>
<name>NSC</name>
<description>Non-Secure Callable</description>
<bitRange>[1:1]</bitRange>
</field>
<!-- ENABLE: -->
<field>
<name>ENABLE</name>
<description>SAU Region enabled</description>
<bitRange>[0:0]</bitRange>
</field>
</fields>
</register>
