nguyentri/da-pac/svd/DA14699.svd
</registers>
</peripheral><peripheral>
	<name>AES_HASH</name>
	<version>1.0</version>
	<description>AES_HASH registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x30040000</baseAddress>
	<size>0</size>
	<addressBlock>
	<offset>0</offset>
	<size>260</size>
	<usage>registers</usage>
</addressBlock>
	<interrupt>
	<name>SNC</name>
	<description>Sensor Node Controller interrupt request.</description>
	<value>0</value>
</interrupt><interrupt>
	<name>DMA</name>
	<description>General Purpose DMA interrupt request.</description>
	<value>1</value>
</interrupt><interrupt>
	<name>CHARGER_STATE</name>
	<description>Charger State interrupt request.</description>
	<value>2</value>
</interrupt><interrupt>
	<name>CHARGER_ERROR</name>
	<description>Charger Error interrupt request.</description>
	<value>3</value>
</interrupt><interrupt>
	<name>CMAC2SYS</name>
	<description>CMAC and mailbox interrupt request.</description>
	<value>4</value>
</interrupt><interrupt>
	<name>UART</name>
	<description>UART interrupt request.</description>
	<value>5</value>
</interrupt><interrupt>
	<name>UART2</name>
	<description>UART2 interrupt request.</description>
	<value>6</value>
</interrupt><interrupt>
	<name>UART3</name>
	<description>UART3 interrupt request.</description>
	<value>7</value>
</interrupt><interrupt>
	<name>I2C</name>
	<description>I2C interrupt request.</description>
	<value>8</value>
</interrupt><interrupt>
	<name>I2C2</name>
	<description>I2C2 interrupt request.</description>
	<value>9</value>
</interrupt><interrupt>
	<name>SPI</name>
	<description>SPI interrupt request.</description>
	<value>10</value>
</interrupt><interrupt>
	<name>SPI2</name>
	<description>SPI2 interrupt request.</description>
	<value>11</value>
</interrupt><interrupt>
	<name>PCM</name>
	<description>PCM interrupt request.</description>
	<value>12</value>
</interrupt><interrupt>
	<name>SRC_IN</name>
	<description>SRC input interrupt request.</description>
	<value>13</value>
</interrupt><interrupt>
	<name>SRC_OUT</name>
	<description>SRC output interrupt request.</description>
	<value>14</value>
</interrupt><interrupt>
	<name>USB</name>
	<description>USB interrupt request.</description>
	<value>15</value>
</interrupt><interrupt>
	<name>TIMER</name>
	<description>TIMER interrupt request.</description>
	<value>16</value>
</interrupt><interrupt>
	<name>TIMER2</name>
	<description>TIMER2 interrupt request.</description>
	<value>17</value>
</interrupt><interrupt>
	<name>RTC</name>
	<description>RTC interrupt request.</description>
	<value>18</value>
</interrupt><interrupt>
	<name>KEY_WKUP_GPIO</name>
	<description>Debounced button press interrupt request.</description>
	<value>19</value>
</interrupt><interrupt>
	<name>PDC</name>
	<description>Wakeup IRQ from PDC to CM33</description>
	<value>20</value>
</interrupt><interrupt>
	<name>VBUS</name>
	<description>VBUS presence interrupt request.</description>
	<value>21</value>
</interrupt><interrupt>
	<name>MRM</name>
	<description>Cache Miss Rate Monitor interrupt request.</description>
	<value>22</value>
</interrupt><interrupt>
	<name>MOTOR_CONTROLLER</name>
	<description>MOTOR and mailbox interrupt request.</description>
	<value>23</value>
</interrupt><interrupt>
	<name>TRNG</name>
	<description>True Random Number Generation interrupt request.</description>
	<value>24</value>
</interrupt><interrupt>
	<name>DCDC</name>
	<description>DCDC interrupt request.</description>
	<value>25</value>
</interrupt><interrupt>
	<name>XTAL32M_RDY</name>
	<description>XTAL32M trimmed and ready interrupt request.</description>
	<value>26</value>
</interrupt><interrupt>
	<name>GPADC</name>
	<description>General Purpose Analog-Digital Converter interrupt request.</description>
	<value>27</value>
</interrupt><interrupt>
	<name>SDADC</name>
	<description>Sigma Delta Analog-Digital Converter interrupt request.</description>
	<value>28</value>
</interrupt><interrupt>
	<name>CRYPTO</name>
	<description>Crypto interrupt request.</description>
	<value>29</value>
</interrupt><interrupt>
	<name>CAPTIMER</name>
	<description>GPIO triggered Timer Capture interrupt request.</description>
	<value>30</value>
</interrupt><interrupt>
	<name>RFDIAG</name>
	<description>Baseband or Radio Diagnostics interrupt request.</description>
	<value>31</value>
</interrupt><interrupt>
	<name>LCD_CONTROLLER</name>
	<description>Parallel LCD Controller interrupt request.</description>
	<value>32</value>
</interrupt><interrupt>
	<name>PLL_LOCK</name>
	<description>Pll lock interrupt request.</description>
	<value>33</value>
</interrupt><interrupt>
	<name>TIMER3</name>
	<description>TIMER3 interrupt request.</description>
	<value>34</value>
</interrupt><interrupt>
	<name>TIMER4</name>
	<description>TIMER4 interrupt request.</description>
	<value>35</value>
</interrupt><interrupt>
	<name>LRA</name>
	<description>LRA/ERM interrupt request.</description>
	<value>36</value>
</interrupt><interrupt>
	<name>RTC_EVENT</name>
	<description>RTC event interrupt request.</description>
	<value>37</value>
</interrupt><interrupt>
	<name>GPIO_P0</name>
	<description>GPIO port 0 toggle interrupt request.</description>
	<value>38</value>
</interrupt><interrupt>
	<name>GPIO_P1</name>
	<description>GPIO port 1 toggle interrupt request.</description>
	<value>39</value>
</interrupt>
	<registers>
	<register>
	<name>CRYPTO_CLRIRQ_REG</name>
	<description>Crypto Clear interrupt request</description>
	<addressOffset>0x00000018</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>CRYPTO_CLRIRQ</name>
	<description>Write 1 to clear a pending interrupt request.</description>
	<bitRange>[0:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>CRYPTO_CTRL_REG</name>
	<description>Crypto Control register</description>
	<addressOffset>0x00000000</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>CRYPTO_AES_KEXP</name>
	<description>It forces (active high) the execution of the key expansion process with the starting of the AES encryption/decryption process. The bit will be cleared automatically by the hardware, after the completion of the AES key expansion process.</description>
	<bitRange>[17:17]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CRYPTO_MORE_IN</name>
	<description>0 : Define that this is the last input block. When the current input is consumed by the crypto engine and the output data is written to the memory, the calculation ends (CRYPTO_INACTIVE goes to one).
1 : The current input data block is not the last. More input data will follow. When the current input is consumed, the engine stops and waits for more data (CRYPTO_WAIT_FOR_IN goes to one).</description>
	<bitRange>[16:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CRYPTO_HASH_OUT_LEN</name>
	<description>The number of bytes minus one of the hash result which will be saved at the memory by the DMA. In relation with the selected hash algorithm the accepted values are:
MD5: 0..15 -&gt; 1-16 bytes
SHA-1: 0..19 -&gt; 1-20 bytes
SHA-256: 0..31 -&gt; 1 - 32 bytes
SHA-256/224: 0..27 -&gt; 1- 28 bytes
SHA-384: 0..47 -&gt; 1 - 48 bytes
SHA-512: 0..63 -&gt; 1 - 64 bytes
SHA-512/224: 0..27 -&gt; 1- 28 bytes
SHA-512/256: 0..31 -&gt; 1 - 32 bytes</description>
	<bitRange>[15:10]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CRYPTO_HASH_SEL</name>
	<description>Selects the type of the algorithm
0 : The encryption algorithm (AES)
1 : A hash algorithm.
The exact algorithm is defined by the fileds CRYPTO_ALG and CRYPTO_ALG_MD.</description>
	<bitRange>[9:9]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CRYPTO_IRQ_EN</name>
	<description>Interrupt Request Enable
0 : The interrupt generation ability is disabled.
1 : The interrupt generation ability is enabled. Generates an interrupt request at the end of operation.</description>
	<bitRange>[8:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CRYPTO_ENCDEC</name>
	<description>Encryption/Decryption
0 : Decryption
1 : Encryption</description>
	<bitRange>[7:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CRYPTO_AES_KEY_SZ</name>
	<description>The size of AES Key
0x0 : 128 bits AES Key
0x1 : 192 bits AES Key
0x2 : 256 bits AES Key
0x3 : 256 bits AES Key</description>
	<bitRange>[6:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CRYPTO_OUT_MD</name>
	<description>Output Mode. This field makes sense only when the AES algorithm is selected (CRYPTO_HASH_SEL =0)
0 : Write back to memory all the resulting data
1 : Write back to memory only the final block of the resulting data</description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CRYPTO_ALG_MD</name>
	<description>It defines the mode of operation of the AES algorithm when the controller is configured for an encryption/decryption processing (CRYPTO_HASH_SEL = 0).
0x0 : ECB
0x1 : ECB
0x2 : CTR
0x3 : CBC

When the controller is configured to applies a HASH function, this field selects the desired HASH algorithm with the help of the CRYPTO_ALG.

0x0 : HASH algorithms that are based on 32 bits operations
0x1 : HASH algorithms that are based on 64 bits operations
0x2 : Reserved
0x3 : Reserved

See also the CRYPTO_ALG field.</description>
	<bitRange>[3:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CRYPTO_ALG</name>
	<description>Algorithm selection. When CRYPTO_HASH_SEL = 0 the only available choice is the AES algorithm.
0x0 : AES
0x1 : Reserved
0x2 : Reserved
0x3 : Reserved

When CRYPTO_HASH_SEL = 1, this field selects the desired hash algorithm, with the help of the CRYPTO_ALG_MD field.

If CRYPTO_ALG_MD = 0x0
0x0 : MD5
0x1 : SHA-1
0x2 : SHA-256/224
0x3 : SHA-256

If CRYPTO_ALG_MD = 0x1
0x0 : SHA-384
0x1 : SHA-512
0x2 : SHA-512/224
0x3 : SHA-512/256


</description>
	<bitRange>[1:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>CRYPTO_DEST_ADDR_REG</name>
	<description>Crypto DMA destination memory</description>
	<addressOffset>0x00000010</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>CRYPTO_DEST_ADDR</name>
	<description>Destination address at where the result of the processing is stored. The value of this register is updated as the calculation proceeds and the output data are written to the memory.</description>
	<bitRange>[31:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>CRYPTO_FETCH_ADDR_REG</name>
	<description>Crypto DMA fetch register</description>
	<addressOffset>0x00000008</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>CRYPTO_FETCH_ADDR</name>
	<description>The memory address from where will be retrieved the data that will be processed. The value of this register is updated as the calculation proceeds and the output data are written to the memory.</description>
	<bitRange>[31:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>CRYPTO_KEYS_START</name>
	<description>Crypto First position of the AES keys storage memory</description>
	<addressOffset>0x00000100</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>CRYPTO_KEY_X</name>
	<description>CRYPTO_KEY_(0-63)
This is the AES keys storage memory. This memory is accessible via AHB slave interface, only when the CRYPTO is inactive (CRYPTO_INACTIVE = 1).</description>
	<bitRange>[31:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>CRYPTO_LEN_REG</name>
	<description>Crypto Length of the input block in bytes</description>
	<addressOffset>0x0000000c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>CRYPTO_LEN</name>
	<description>It contains the number of bytes of input data. If this number is not a multiple of a block size, the data is automatically extended with zeros. The value of this register is updated as the calculation proceeds and the output data are written to the memory.</description>
	<bitRange>[23:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>CRYPTO_MREG0_REG</name>
	<description>Crypto Mode depended register 0</description>
	<addressOffset>0x0000001c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>CRYPTO_MREG0</name>
	<description>It contains information that are depended by the mode of operation, when is used the AES algorithm:
CBC - IV[31:0]
CTR - CTRBLK[31:0]. It is the initial value of the 32 bits counter.
At any other mode, the contents of this register has no meaning.</description>
	<bitRange>[31:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>CRYPTO_MREG1_REG</name>
	<description>Crypto Mode depended register 1</description>
	<addressOffset>0x00000020</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>CRYPTO_MREG1</name>
	<description>It contains information that are depended by the mode of operation, when is used the AES algorithm:
CBC - IV[63:32]
CTR - CTRBLK[63:32]
At any other mode, the contents of this register has no meaning.</description>
	<bitRange>[31:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>CRYPTO_MREG2_REG</name>
	<description>Crypto Mode depended register 2</description>
	<addressOffset>0x00000024</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>CRYPTO_MREG2</name>
	<description>It contains information that are depended by the mode of operation, when is used the AES algorithm:
CBC - IV[95:64]
CTR - CTRBLK[95:64]
At any other mode, the contents of this register has no meaning.</description>
	<bitRange>[31:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>CRYPTO_MREG3_REG</name>
	<description>Crypto Mode depended register 3</description>
	<addressOffset>0x00000028</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>CRYPTO_MREG3</name>
	<description>It contains information that are depended by the mode of operation, when is used the AES algorithm:
CBC - IV[127:96]
CTR - CTRBLK[127:96]
At any other mode, the contents of this register has no meaning.</description>
	<bitRange>[31:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>CRYPTO_START_REG</name>
	<description>Crypto Start calculation</description>
	<addressOffset>0x00000004</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>CRYPTO_START</name>
	<description>Write 1 to initiate the processing of the input data. This register is auto-cleared.</description>
	<bitRange>[0:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>CRYPTO_STATUS_REG</name>
	<description>Crypto Status register</description>
	<addressOffset>0x00000014</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000001</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>CRYPTO_IRQ_ST</name>
	<description>The status of the interrupt request line of the CRYPTO block.
0 : There is no active interrupt request.
1 : An interrupt request is pending.</description>
	<bitRange>[2:2]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>CRYPTO_WAIT_FOR_IN</name>
	<description>Indicates the situation where the engine waits for more input data. This is applicable when the CRYPTO_MORE_IN= 1, so the input data are fragmented in the memory.
0 : The crypto is not waiting for more input data.
1 : The crypto waits for more input data.
The CRYPTO_INACTIVE flag remains to zero to indicate that the calculation is not finished. The supervisor of the CRYPTO must program to the CRYPTO_FETCH_ADDR and CRYPTO_LEN a new input data fragment. The calculation will be continued as soon as the CRYPTO_START register will be written with 1. This action will clear the CRYPTO_WAIT_FOR_IN flag.</description>
	<bitRange>[1:1]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>CRYPTO_INACTIVE</name>
	<description>0 : The CRYPTO is active. The processing is in progress.
1 : The CRYPTO is inactive. The processing has finished.</description>
	<bitRange>[0:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>ANAMISC</name>
	<version>1.0</version>
	<description>ANAMISC registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x50030b00</baseAddress>
	<size>0</size>
	<addressBlock>
	<offset>0</offset>
	<size>28</size>
	<usage>registers</usage>
</addressBlock>
	
