nguyentri/da-pac/svd/DA14699.svd
When I_EOC_DOUBLE_RANGE = 1, The range is:
000 : 8 percent
001 : 11.5 percent
010 : 15 percent
011 : 18.5 percent
100 : 22 percent
101 : 25.5 percent
110 : 29 percent
111 : 32.5 percent</description>
	<bitRange>[14:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>I_PRECHARGE</name>
	<description>This bit-field determines the Pre-Charge current, in mA, ranging from 0.5 to 56mA, according to the following encoding:
0   :  0.5 mA
1   :  1  mA
2   :  1.5mA
3   :  2 mA
4   :  2.5mA
5   :  3  mA
6   :  3.5mA
7   :  4  mA
8   :  4.5mA
9   :  5  mA
10 :  5.5mA
11 :  6  mA
12 :  6.5mA
13 :  7  mA
14 :  7.5mA
15 :  8  mA
16 :  9  mA
17 : 10 mA
18 : 11 mA
19 : 12 mA
20 : 13 mA
21 : 14 mA
22 : 15 mA
23 : 16 mA
24 : 17 mA
25 : 18 mA
26 : 19 mA
27 : 20 mA
28 : 21 mA
29 : 22 mA
30 : 23 mA
31 : 24 mA
32 : 26 mA
33 : 28 mA
34 : 30 mA
35 : 32 mA
36 : 34 mA
37 : 36 mA
38 : 38 mA
39 : 40 mA
40 : 42 mA
41 : 44 mA
42 : 46 mA
43 : 48 mA
44 : 50 mA
45 : 52 mA
46 : 54 mA
47 : 56 mA
48 : 56 mA
49 : 56 mA
50 : 56 mA
51 : 56 mA
52 : 56 mA
53 : 56 mA
54 : 56 mA
55 : 56 mA
56 : 56 mA
57 : 56 mA
58 : 56 mA
59 : 56 mA
60 : 56 mA
61 : 56 mA
62 : 56 mA
63 : 56 mA</description>
	<bitRange>[11:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>I_CHARGE</name>
	<description>This bit-field determines the charge current range, in mA. The range is from 5mA to 560mA, according to the following encoding:
0   :   5 mA
1   :  10 mA
2   :  15 mA
3   :  20 mA
4   :  25 mA
5   :  30 mA
6   :  35 mA
7   :  40 mA
8   :  45 mA
9   :  50 mA
10 :  55 mA
11 :  60 mA
12 :  65 mA
13 :  70 mA
14 :  75 mA
15 :  80 mA
16 :  90 mA
17 : 100 mA
18 : 110 mA
19 : 120 mA
20 : 130 mA
21 : 140 mA
22 : 150 mA
23 : 160 mA
24 : 170 mA
25 : 180 mA
26 : 190 mA
27 : 200 mA
28 : 210 mA
29 : 220 mA
30 : 230 mA
31 : 240 mA
32 : 260 mA
33 : 280 mA
34 : 300 mA
35 : 320 mA
36 : 340 mA
37 : 360 mA
38 : 380 mA
39 : 400 mA
40 : 420 mA
41 : 440 mA
42 : 460 mA
43 : 480 mA
44 : 500 mA
45 : 520 mA
46 : 540 mA
47 : 560 mA
48 : 560 mA
49 : 560 mA
50 : 560 mA
51 : 560 mA
52 : 560 mA
53 : 560 mA
54 : 560 mA
55 : 560 mA
56 : 560 mA
57 : 560 mA
58 : 560 mA
59 : 560 mA
60 : 560 mA
61 : 560 mA
62 : 560 mA
63 : 560 mA
Note: It has to be noted that the specific values correspond to the normal battery temperature zone. However, the specific register field may be updated by the JEITA FSM (which checks the battery temperature either once or periodically), in order to adapt the Charge current to the new battery temperature zone (see also CHARGER_CTRL_REG.TBAT_MONITOR_MODE field as well). This is valid also for the Pre-Charge current field of this register and provided that JEITA support is enabled in CHARGER_CTRL_REG.
Consequently, in that case the register return the Charge current settings that abide to the JEITA requirements for the battery (either COOL, WARM or NORMAL).</description>
	<bitRange>[5:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>CHARGER_CV_CHARGE_TIMER_REG</name>
	<description>Maximum CV-charge time limit register</description>
	<addressOffset>0x00000020</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00001c20</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>CV_CHARGE_TIMER</name>
	<description>Returns the current value of the CV-Charge timeout counter, running at a 1Hz clock. The range of the specific timer is identical to the one of the Pre-Charge and the CC-Charge timers, so it may count up to 6 hours, ranging from 0 to MAX_CV_CHARGE_TIME. It is reset to 0 when the Charger's FSM is either in DISABLED or in END_OF_CHARGE state.</description>
	<bitRange>[30:16]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>MAX_CV_CHARGE_TIME</name>
	<description>This bit-field determines the maximum time (measured in ticks of the Charger's 1Hz clock) allowed for the CV (Constant Voltage) charging stage. If this is exceeded, a CV charge time-out error will be captured by the Charger's control unit and its FSM will move to the ERROR state. In order to exit this state and re-start charging, the CHARGER_RESUME bit-field of CHARGER_CTRL_REG must be set.
Note: The specific bit-field should be always set to a non-zero value.</description>
	<bitRange>[14:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>CHARGER_ERROR_IRQ_CLR_REG</name>
	<description>Interrupt clear register of Charger Error IRQs</description>
	<addressOffset>0x0000006c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000007f</resetMask>
	<fields><field>
	<name>TBAT_ERROR_IRQ_CLR</name>
	<description>Writing a 1 will reset the respective Charger's Error IRQ status bit ; writing a 0 will have no effect</description>
	<bitRange>[6:6]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>TDIE_ERROR_IRQ_CLR</name>
	<description>Writing a 1 will reset the respective Charger's Error IRQ status bit ; writing a 0 will have no effect</description>
	<bitRange>[5:5]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>VBAT_OVP_ERROR_IRQ_CLR</name>
	<description>Writing a 1 will reset the respective Charger's Error IRQ status bit ; writing a 0 will have no effect</description>
	<bitRange>[4:4]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>TOTAL_CHARGE_TIMEOUT_IRQ_CLR</name>
	<description>Writing a 1 will reset the respective Charger's Error IRQ status bit ; writing a 0 will have no effect</description>
	<bitRange>[3:3]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>CV_CHARGE_TIMEOUT_IRQ_CLR</name>
	<description>Writing a 1 will reset the respective Charger's Error IRQ status bit ; writing a 0 will have no effect</description>
	<bitRange>[2:2]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>CC_CHARGE_TIMEOUT_IRQ_CLR</name>
	<description>Writing a 1 will reset the respective Charger's Error IRQ status bit ; writing a 0 will have no effect</description>
	<bitRange>[1:1]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>PRECHARGE_TIMEOUT_IRQ_CLR</name>
	<description>Writing a 1 will reset the respective Charger's Error IRQ status bit ; writing a 0 will have no effect</description>
	<bitRange>[0:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>CHARGER_ERROR_IRQ_MASK_REG</name>
	<description>Mask register of Charger Error IRQs</description>
	<addressOffset>0x0000005c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000007f</resetMask>
	<fields><field>
	<name>TBAT_ERROR_IRQ_EN</name>
	<description>When set, it enables the generation of Battery temperature IRQs.The IRQ is generated as soon as the JEITA FSM detects that the battery temperature is either in the &quot;Hot&quot; or in the &quot;Cold&quot; temperature region, by sampling the respective comparators' output.</description>
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TDIE_ERROR_IRQ_EN</name>
	<description>When set, it enables the generation of Die temperature error IRQs. The IRQ is generated as soon as a Die temperature error is captured, so as soon as the Charger's FSM moves to the TDIE_PROT state. For this to happen, the Die temperature comparator should indicate that Die temperature has exceeded the limit defined in CHARGER_TEMPSET_PARAM_REG.TDIE_MAX.</description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>VBAT_OVP_ERROR_IRQ_EN</name>
	<description>When set, it enables the generation of VBAT_OVP IRQs. The IRQ is generated as soon as the dedicated Vbat comparator shows that Vbat has exceeded the OVP level and the Charger's FSM has switched to the respective error state (&quot;ERROR&quot;).</description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TOTAL_CHARGE_TIMEOUT_IRQ_EN</name>
	<description>When set, it enables the total charge timeout IRQs. The IRQ is generated as soon as the Charger's global charge timer expires, reaching 0.</description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CV_CHARGE_TIMEOUT_IRQ_EN</name>
	<description>When set, it enables the CV charge timeout IRQs. The IRQ is generated as soon as the Charger's state timer expires, reaching 0 when the FSM is in the CV_CHARGE state.</description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CC_CHARGE_TIMEOUT_IRQ_EN</name>
	<description>When set, it enables the CC charge timeout IRQs. The IRQ is generated as soon as the Charger's state timer, expires, reaching 0.</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PRECHARGE_TIMEOUT_IRQ_EN</name>
	<description>When set, it enables the Pre-Charge timeout IRQs. The IRQ is generated as soon as the Charger's state timer expires, reaching 0.</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>CHARGER_ERROR_IRQ_STATUS_REG</name>
	<description>Status register of Charger Error IRQs</description>
	<addressOffset>0x00000064</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000007f</resetMask>
	<fields><field>
	<name>TBAT_ERROR_IRQ</name>
	<description>0 = No Battery temperature error IRQ event is captured, so charging may continue
1 = A Battery temperature error IRQ event has been captured, declaring that the Charger's FSM has moved to the respective error state (TBAT_PROT).
Note : The status bit is updated automatically when the Battery temperature is detected to be either in the HOT or in the COLD zone, regardless of the state of the respective IRQ mask bit.</description>
	<bitRange>[6:6]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>TDIE_ERROR_IRQ</name>
	<description>0 = No Die temperature error IRQ events have been captured, so charging may continue
1 = A Die temperature error IRQ event is captured, declaring that the Charger's FSM has switched to the respective error state (TDIE_PROT) and charging will be automatically stopped.
Note : The status bit is updated automatically when a Die temperature error is detected, thus when the die temperature is found to have exceeded the programmed level, regardless of the stae of the respective IRQ mask bit.</description>
	<bitRange>[5:5]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>VBAT_OVP_ERROR_IRQ</name>
	<description>0 = Vbat has not exceeded the Over-Voltage Protection (OVP) level, so charging may continue
1 = Vbat has exceeded the Over-Voltage level, thus an OVP error event has been captured. The Charger's FSM switches to the respective error state (ERROR) as soon as the OVP event is captured by the digital part of the Charger and charging will be automatically stopped.</description>
	<bitRange>[4:4]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>TOTAL_CHARGE_TIMEOUT_IRQ</name>
	<description>0 = Total charge time counter has not yet reached the maximum charge time (set in CHARGER_TOTAL_CHARGE_TIME_REG)
1 = Total charge time counter has reached the maximum charge time programmed. The Charger's FSM will move to the respective error state (ERROR) and charging will be automatically stopped, as soon as the specific event is captured.</description>
	<bitRange>[3:3]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>CV_CHARGE_TIMEOUT_IRQ</name>
	<description>0 = State charge time counter has not yet reached the maximum CV charge time (set in CHARGER_CV_CHARGE_TIME_REG)
1 = Total charge time counter has reached the maximum CV charge time programmed. The Charger's FSM will move to the respective error state (ERROR) and charging will be automatically stopped, as soon as the specific event is captured.</description>
	<bitRange>[2:2]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>CC_CHARGE_TIMEOUT_IRQ</name>
	<description>0 = State charge time counter has not yet reached the maximum CC charge time (set in CHARGER_CC_CHARGE_TIME_REG)
1 = Total charge time counter has reached the maximum CC charge time programmed. The Charger's FSM will move to the respective error state (ERROR) and charging will be automatically stopped, as soon as the specific event is captured.</description>
	<bitRange>[1:1]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>PRECHARGE_TIMEOUT_IRQ</name>
	<description>0 = State charge time counter has not yet reached the maximum Pre-charge time (set in CHARGER_PRECHARGE_TIME_REG)
1 = Total charge time counter has reached the maximum Pre-charge time programmed. The Charger's FSM will move to the respective error state (ERROR) and charging will be automatically stopped, as soon as the specific event is captured.</description>
	<bitRange>[0:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>CHARGER_JEITA_CURRENT_REG</name>
	<description>JEITA-compliant current settings register</description>
	<addressOffset>0x00000038</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00042105</resetValue>
	<resetMask>0x00ffffff</resetMask>
	<fields><field>
	<name>I_PRECHARGE_TWARM</name>
	<description>Pre-Charge current setting for the Warm battery temperature zone. Regarding the range of values of this bit-field, see also the description of I_PRECHARGE field of CHARGER_CURRENT_PARAM_REG register.</description>
	<bitRange>[23:18]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>I_PRECHARGE_TCOOL</name>
	<description>Pre-Charge current setting for the Cool battery temperature zone. Regarding the range of values of this bit-field, see also the description of I_PRECHARGE field of CHARGER_CURRENT_PARAM_REG register.</description>
	<bitRange>[17:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>I_CHARGE_TWARM</name>
	<description>Charge current setting for the Warm battery temperature pack zone. Regarding the range of values of this bit-field, see also the description of I_CHARGE field of CHARGER_CURRENT_PARAM_REG register.</description>
	<bitRange>[11:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>I_CHARGE_TCOOL</name>
	<description>Charge current setting for the &quot;COOL&quot; battery temperature level. Regarding the range of values of this bit-field, see also the description of I_CHARGE field of CHARGER_CURRENT_PARAM_REG register.</description>
	<bitRange>[5:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>CHARGER_JEITA_V_CHARGE_REG</name>
	<description>JEITA-compliant Charge voltage settings register</description>
	<addressOffset>0x00000028</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000a68</resetValue>
	<resetMask>0x00000fff</resetMask>
	<fields><field>
	<name>V_CHARGE_TWARM</name>
	<description>Charge voltage setting for the Warm battery temperature zone. Regarding the range of values of this bit-field, see also the description of V_CHARGE field of CHARGER_VOLTAGE_PARAM_REG register.</description>
	<bitRange>[11:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>V_CHARGE_TCOOL</name>
	<description>Charge voltage setting for the Cool battery temperature zone. Regarding the range of values of this bit-field, see also the description of V_CHARGE field of CHARGER_VOLTAGE_PARAM_REG register.</description>
	<bitRange>[5:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>CHARGER_JEITA_V_OVP_REG</name>
	<description>JEITA-compliant OVP settings register</description>
	<addressOffset>0x00000034</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000d76</resetValue>
	<resetMask>0x00000fff</resetMask>
	<fields><field>
	<name>V_OVP_TWARM</name>
	<description>VBAT Over-voltage Protection (OVP) setting for the Warm battery temperature zone.Regarding the range of values of this bit-field, see also the description of V_CHARGE field of CHARGER_VOLTAGE_PARAM_REG.</description>
	<bitRange>[11:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>V_OVP_TCOOL</name>
	<description>VBAT Over-voltage Protection (OVP) setting for the Cool battery temperature zone.Regarding the range of values of this bit-field, see also the description of V_CHARGE field of CHARGER_VOLTAGE_PARAM_REG.</description>
	<bitRange>[5:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>CHARGER_JEITA_V_PRECHARGE_REG</name>
	<description>JEITA-compliant Pre-Charge voltage settings register</description>
	<addressOffset>0x0000002c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000187</resetValue>
	<resetMask>0x00000fff</resetMask>
	<fields><field>
	<name>V_PRECHARGE_TWARM</name>
	<description>Pre-Charge voltage setting for the Warm battery temperature zone. Regarding the range of values of this bit-field, see also the description of V_CHARGE field of CHARGER_VOLTAGE_PARAM_REG register.</description>
	<bitRange>[11:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>V_PRECHARGE_TCOOL</name>
	<description>Pre-Charge current setting for the Cool battery temperature zone. Regarding the range of values of this bit-field, see also the description of V_CHARGE field of CHARGER_VOLTAGE_PARAM_REG register.</description>
	<bitRange>[5:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>CHARGER_JEITA_V_REPLENISH_REG</name>
	<description>JEITA-compliant Replenish settings register</description>
	<addressOffset>0x00000030</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x0000079f</resetValue>
	<resetMask>0x00000fff</resetMask>
	<fields><field>
	<name>V_REPLENISH_TWARM</name>
	<description>Replenish voltage setting for the Warm battery temperature zone. Regarding the range of values of this bit-field, see also the description of V_CHARGE field of CHARGER_VOLTAGE_PARAM_REG.</description>
	<bitRange>[11:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>V_REPLENISH_TCOOL</name>
	<description>Replenish voltage setting for the Cool battery temperature zone. Regarding the range of values of this bit-field, see also the description of V_CHARGE field of CHARGER_VOLTAGE_PARAM_REG.</description>
	<bitRange>[5:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>CHARGER_PRE_CHARGE_TIMER_REG</name>
	<description>Maximum pre-charge time limit register</description>
	<addressOffset>0x00000018</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000708</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>PRE_CHARGE_TIMER</name>
	<description>Returns the current value of the Pre-Charge timeout counter, running at a 1Hz clock. The range of the specific timer is identical to the one of the CC-Charge and the CV-Charge timers, so it may count up to 6 hours, ranging from 0 to MAX_PRE_CHARGE_TIME. It is reset to 0 when the Charger's FSM is either in DISABLED or in END_OF_CHARGE state.</description>
	<bitRange>[30:16]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>MAX_PRE_CHARGE_TIME</name>
	<description>This bit-field determines the maximum time (measured in ticks of the Charger's 1Hz clock) allowed for the Pre-Charge stage. If this is exceeded, a Pre-Charge time-out error will be captured by the Charger's control unit and its FSM will move to the respective state (ERROR). In order to exit this state and re-start charging, the CHARGER_RESUME bit-field of CHARGER_CTRL_REG must be set.
Note: The specific bit-field should be always set to a non-zero value.</description>
	<bitRange>[14:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>CHARGER_PWR_UP_TIMER_REG</name>
	<description>Charger power-up (settling) timer</description>
	<addressOffset>0x00000054</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000063</resetValue>
	<resetMask>0x03ffffff</resetMask>
	<fields><field>
	<name>CHARGER_PWR_UP_TIMER</name>
	<description>Returns the current value of the charger's power-up timer, running with the 1Khz clock.
Note: The specific timer is reset to the value programmed to CHARGER_PWR_UP_SETTLING bit-field, when the Charger's analogue circuitry has been enabled, after being disabled initially. By setting CHARGER_CTRL_REG[CHARGER_ENABLE] to '0', the analogue part is disabled and in order to be properly enable, SW has to wait for 1ms (one 1Khz clock period) time. The latter is is needed to ensure that the power-up timer's control signals in the Charger's digital part will be cleared when the analogue part is again enabled, so that a proper new start-up of the Charger's FSM is possible.</description>
	<bitRange>[25:16]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>CHARGER_PWR_UP_SETTLING</name>
	<description>This bit-field determines the charger's power-up (settling) time, required for the analogue circuitry of the charger. As soon as the charger is powered-on by setting the CHARGER_ENABLE bit-field of CHARGER_CTRL_REG, the charger's FSM loads a dedicated timer with this value and waits for this timer to expire, before proceeding to the next states.
Note: The specific bit-field should be always set to a non-zero value.</description>
	<bitRange>[9:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>CHARGER_STATE_IRQ_CLR_REG</name>
	<description>Interrupt clear register of Charger FSM IRQs</description>
	<addressOffset>0x00000068</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000fff</resetMask>
	<fields><field>
	<name>CV_TO_PRECHARGE_IRQ_CLR</name>
	<description>Writing a 1 will reset the respective Charger's State IRQ status bit ; writing a 0 will have no effect</description>
	<bitRange>[11:11]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>CC_TO_PRECHARGE_IRQ_CLR</name>
	<description>Writing a 1 will reset the respective Charger's State IRQ status bit ; writing a 0 will have no effect</description>
	<bitRange>[10:10]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>CV_TO_CC_IRQ_CLR</name>
	<description>Writing a 1 will reset the respective Charger's State IRQ status bit ; writing a 0 will have no effect</description>
	<bitRange>[9:9]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>TBAT_STATUS_UPDATE_IRQ_CLR</name>
	<description>Writing a 1 will reset the Battery temperature status update IRQ status bit ; writing a 0 will have no effect</description>
	<bitRange>[8:8]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>TBAT_PROT_TO_PRECHARGE_IRQ_CLR</name>
	<description>Writing a 1 will reset the respective Charger's State IRQ status bit ; writing a 0 will have no effect</description>
	<bitRange>[7:7]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>TDIE_PROT_TO_PRECHARGE_IRQ_CLR</name>
	<description>Writing a 1 will reset the respective Charger's State IRQ status bit ; writing a 0 will have no effect</description>
	<bitRange>[6:6]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>EOC_TO_PRECHARGE_IRQ_CLR</name>
	<description>Writing a 1 will reset the respective Charger's State IRQ status bit ; writing a 0 will have no effect</description>
	<bitRange>[5:5]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>CV_TO_EOC_IRQ_CLR</name>
	<description>Writing a 1 will reset the respective Charger's State IRQ status bit ; writing a 0 will have no effect</description>
	<bitRange>[4:4]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>CC_TO_EOC_IRQ_CLR</name>
