nguyentri/da-pac/svd/DA14699.svd
	<description>Writing a 1 will reset the respective Charger's State IRQ status bit ; writing a 0 will have no effect</description>
	<bitRange>[3:3]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>CC_TO_CV_IRQ_CLR</name>
	<description>Writing a 1 will reset the respective Charger's State IRQ status bit ; writing a 0 will have no effect</description>
	<bitRange>[2:2]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>PRECHARGE_TO_CC_IRQ_CLR</name>
	<description>Writing a 1 will reset the respective Charger's State IRQ status bit ; writing a 0 will have no effect</description>
	<bitRange>[1:1]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>DISABLED_TO_PRECHARGE_IRQ_CLR</name>
	<description>Writing a 1 will reset the respective Charger's State IRQ status bit ; writing a 0 will have no effect</description>
	<bitRange>[0:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>CHARGER_STATE_IRQ_MASK_REG</name>
	<description>Mask register of Charger FSM IRQs</description>
	<addressOffset>0x00000058</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000fff</resetMask>
	<fields><field>
	<name>CV_TO_PRECHARGE_IRQ_EN</name>
	<description>When set, this bit-field enables the IRQ generation as soon as the Charger's FSM switches from CV_CHARGE to PRE_CHARGE state.</description>
	<bitRange>[11:11]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CC_TO_PRECHARGE_IRQ_EN</name>
	<description>When set, this bit-field enables the IRQ generation as soon as the Charger's FSM switches from CC_CHARGE to PRE_CHARGE state.</description>
	<bitRange>[10:10]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CV_TO_CC_IRQ_EN</name>
	<description>When set, this bit-field enables the IRQ generation as soon as the Charger's FSM switches from CV_CHARGE to CC_CHARGE state.</description>
	<bitRange>[9:9]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TBAT_STATUS_UPDATE_IRQ_EN</name>
	<description>When set, this bit-field enables the generation of the Charger's state IRQ as soon as the battery temperature status is refreched by the Charger's Battery temperature monitor (JEITA) FSM. As soon as the specific FSM checks the current battery temperature level, it notifies the main Charger FSM that it has run and that the Battery temperature pack state is checked (and potentially refreshed with a new status).</description>
	<bitRange>[8:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TBAT_PROT_TO_PRECHARGE_IRQ_EN</name>
	<description>When set, this bit-field enables the Charger's state IRQ generation as soon as the Charger's FSM switches from the Battery temperature protection state (TBAT_PROT) to PRE_CHARGE, resuming charging.</description>
	<bitRange>[7:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TDIE_PROT_TO_PRECHARGE_IRQ_EN</name>
	<description>When set, this bit-field enables the Charger's state IRQ generation as soon as the Charger's FSM switches from the Die temperature protection state (TDIE_PROT) to PRE_CHARGE, resuming charging.</description>
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>EOC_TO_PRECHARGE_IRQ_EN</name>
	<description>When set, this bit-field enables the Charger's State IRQ generation as soon as the Charger's FSM switches from END_OF_CHARGE again to PRE_CHARGE state. This happens when the Vbat voltage level is detected to be below the Replenish level set.</description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CV_TO_EOC_IRQ_EN</name>
	<description>When set, this bit-field enables the IRQ generation as soon as the Charger's FSM switches from CV_CHARGE to END_OF_CHARGE state.</description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CC_TO_EOC_IRQ_EN</name>
	<description>When set, this bit-field enables the IRQ generation as soon as the Charger's FSM switches from CC_CHARGE to END_OF_CHARGE state.</description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CC_TO_CV_IRQ_EN</name>
	<description>When set, this bit-field enables the IRQ generation as soon as the Charger's FSM switches from CC_CHARGE to CV_CHARGE state.</description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PRECHARGE_TO_CC_IRQ_EN</name>
	<description>When set, this bit-field enables the IRQ generation as soon as the Charger's FSM switches from PRE_CHARGE to CC_CHARGE state..</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DISABLED_TO_PRECHARGE_IRQ_EN</name>
	<description>When set, this bit-field enables the IRQ generation as soon as the Charger's FSM switches from DISABLED to PRE_CHARGE state.</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>CHARGER_STATE_IRQ_STATUS_REG</name>
	<description>Status register of Charger FSM IRQs</description>
	<addressOffset>0x00000060</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000fff</resetMask>
	<fields><field>
	<name>CV_TO_PRECHARGE_IRQ</name>
	<description>0 = No transition of the Charger's FSM from CV_CHARGE to PRE_CHARGE state has been captured
1 = Charger's FSM has switched from CV_CHARGE to PRE_CHARGE state</description>
	<bitRange>[11:11]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>CC_TO_PRECHARGE_IRQ</name>
	<description>0 = No transition of the Charger's FSM from CC_CHARGE to PRE_CHARGE state has been captured
1 = Charger's FSM has switched from CC_CHARGE to PRE_CHARGE state</description>
	<bitRange>[10:10]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>CV_TO_CC_IRQ</name>
	<description>0 = No transition of the Charger's FSM from CV_CHARGE to CC_CHARGE state has been captured
1 = Charger's FSM has switched from CV_CHARGE to CC_CHARGE state</description>
	<bitRange>[9:9]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>TBAT_STATUS_UPDATE_IRQ</name>
	<description>0 = No battery temperature status update event has been captured
1 = Battery temperature pack's status has been checked and refreshed by the Charger's Battery temperature monitor FSM. Thus, the new status of the battery temperature should be checked by SW.</description>
	<bitRange>[8:8]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>TBAT_PROT_TO_PRECHARGE_IRQ</name>
	<description>0 = No transition of the Charger's FSM from TBAT_PROT to PRE_CHARGE state has been captured
1 = Charger's FSM has switched from TBAT_PROT to PRE_CHARGE state, resuming charging after having recovered from a battery temperature error.</description>
	<bitRange>[7:7]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>TDIE_PROT_TO_PRECHARGE_IRQ</name>
	<description>0 = No transition of the Charger's FSM from TDIE_PROT to PRE_CHARGE state has been captured
1 = Charger's FSM has switched from TDIE_PROT to PRE_CHARGE state, resuming charging after having recovered from a Die temperature error.</description>
	<bitRange>[6:6]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>EOC_TO_PRECHARGE_IRQ</name>
	<description>0 = No transition of the Charger's FSM from END_OF_CHARGE to PRE_CHARGE state has been captured
1 = Charger's FSM has switched from END_OF_CHARGE to PRE_CHARGE state</description>
	<bitRange>[5:5]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>CV_TO_EOC_IRQ</name>
	<description>0 = No transition of the Charger's FSM from CV_CHARGE to END_OF_CHARGE state has been captured
1 = Charger's FSM has switched from CV_CHARGE to END_OF_CHARGE state</description>
	<bitRange>[4:4]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>CC_TO_EOC_IRQ</name>
	<description>0 = No transition of the Charger's FSM from CC_CHARGE to END_OF_CHARGE state has been captured
1 = Charger's FSM has switched from CC_CHARGE to END_OF_CHARGE state</description>
	<bitRange>[3:3]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>CC_TO_CV_IRQ</name>
	<description>0 = No transition of the Charger's FSM from CC_CHARGE to CV_CHARGE state has been captured
1 = Charger's FSM has switched from CC_CHARGE to CV_CHARGE state</description>
	<bitRange>[2:2]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>PRECHARGE_TO_CC_IRQ</name>
	<description>0 = No transition of the Charger's FSM from PRE_CHARGE to CC_CHARGE state has been captured
1 = Charger's FSM has switched from PRE_CHARGE to CC_CHARGE state</description>
	<bitRange>[1:1]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DISABLED_TO_PRECHARGE_IRQ</name>
	<description>0 = No transition of the Charger's FSM from DISABLED to PRE_CHARGE state has been captured
1 = Charger's FSM has switched from DISABLED to PRE_CHARGE state</description>
	<bitRange>[0:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>CHARGER_STATUS_REG</name>
	<description>Charger main status register</description>
	<addressOffset>0x00000008</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000200</resetValue>
	<resetMask>0x3fffffff</resetMask>
	<fields><field>
	<name>OVP_EVENTS_DEBOUNCE_CNT</name>
	<description>The specific bit-field returns the consecutive number of times Vbat has exceeded the programmed Over-Voltage Protection (OVP) level. It is used to determine when the Charger's FSM will exit any of the charging states (PRE/CC/CV_CHARGE) and will switch to the ERROR state due to an OVP error. This will happen as soon as the respective counter of OVP events reaches or exceeds a fixed number (4), similar to the approach adopted in the End-of-Charge and Die Temperature debouncing mechanisms.
The specific counter increases only while the Charger's FSM is in any of the three charging,states, the Vbat OVP interval check timer has reached the threshold set and when Vbat OVP comparator's output is asserted.
Note 1 : By default, as soon as the counter reaches 4, the FSM will switch to the ERROR state and the counter will reset again. Thus, in that case the specific counter ranges from 0 to 4 and vice-versa. However, if the monitoring of Vbat OVP comparator's state is less frequent than 5 (4+1) times the CHARGER_OVP_COMP_TIMER_REG[OVP_INTERVAL_CHECK_THRES] and Vbat has exceeded the OVP voltage level based on the comparator's output signal, then this counter will exceed 4 and may overflow.
This will not harm, however, the detection of the OVP event, as it only increases the number of OVP event occurrences by the debounce timer, until the OVP comparator timer's settling time has expired. Thus, the Charger FSM will again switch to ERROR when the counter has reached or exceeded 4 (bit [2] of OVP_EVENTS_DEBOUNCE_CNT is set) and the OVP comparator's timer has expired.
Note 2: See also the OVP_INTERVAL_CHECK_TIMER, OVP_INTERVAL_CHECK_THRES of CHARGER_OVP_COMP_TIMER_REG, for the debouncing mechanism of the Vbat OVP comparator's output.</description>
	<bitRange>[29:27]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>EOC_EVENTS_DEBOUNCE_CNT</name>
	<description>The specific bit-field returns the number of times the End-of-Charge signal has been consecutively found to be high. It is used to determine when the Charger's FSM will switch from CV_CHARGE to END_OF_CHARGE state, implementing a debounce mechanism on End-of-Charge signal, coming from the analogue circuitry of the Charger towards the FSM.
The specific counter, running with the Charger's 1Mhz clock:
  - Increases after detecting that the End-of-Charge signal is high when the respective interval for the End-of-Charge check expires. This actually happens after having detected a positive edge on End-of-Charge signal, since only after that is it possible for the interval timer to start ticking.
  - Resets to zero when End-of-Charge is seen low when the interval timer has expired or when an End-of-Charge negative edge is seen before the timer's expiration, starting-over.
  - Does not count if End-of-Charge signal is seen high and either the CV_MODE signal (also driven by the analogue circutry) or the End-of-Charge signal of the previous clock cycle is seen low.
  - Is reset when the Charger's FSM is not in either the CC_CHARGE or the CV_CHARGE state or after having reached &quot;100&quot;(4). This is the threshold after which the End-of-Charge signal is considered stable by the Charger's FSM, to switch to the END_OF_CHARGE state. Thus, in practice, the specific counter (and bit-field) ranges between 0 and 4.
Note: See also the EOC_INTERVAL_CHECK_TIMER/THRES bit-fields of CHARGER_CTRL_REG.</description>
	<bitRange>[26:24]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>TDIE_ERROR_DEBOUNCE_CNT</name>
	<description>The specific bit-field returns the consecutive number of times the Die temperature is seen either above (for the case of an error) or below (for the case of recovering from an error) the set Die temperature level.This is performed by a counter, which is increased:
- Each time the Die temperature comparator shows that Die temperature exceeds the set level, and while charging is active, provided that Die temperature protection is enabled. If, however, the CHARGER_CTRL_REG.TDIE_PROT_ENABLE bit-field is not set, the counter is reset and stays frozen to zero.
- Each time the Die temperature comparator shows that Die temperature is again below the set level, and while the FSM is in the Die temperature protection error state (TDIE_PROT) and the TDIE_ERROR_RESUME bit-field of CHARGER_CTRL_REG is set. If the specific bit-field is not set, the debounce counter is reset to 0 and it is kept frozen until the FSM is again enabled to resume from Die temperature errors.
If the Die temperature comparator of the Charger's analogue circuitry shows that temperature has exceeded the programmed level for four consecutive times and charging is active, the Charger's FSM considers this as a Die temperature error and moves to the TDIE_PROT state, resetting the timer at the same time and of course halting charging.
To recover from this state and resume charging, the FSM needs to see that Die temperature is below the programmed level for four consecutive times, again, provided that the TDIE_ERROR_RESUME bit-field of CHARGER_CTRL_REG is set. As soon as this happens, the error counter is again reset and the Charger's FSM resumes, by moving to PRE_CHARGE state. Consequently, the counter's value always ranges from 0 to 4.
Note: When the Charger's FSM is in BYPASSED state, then this bit-field is reset and kept frozen to zero. Consequently, the number of times Die temperature has exceeded the pre-programmed threshold should be determined by SW.</description>
	<bitRange>[23:21]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>CHARGER_JEITA_STATE</name>
	<description>Returns the state of the Charger's JEITA FSM. This FSM is used to update the state of the battery temperature pack, depending on the value programmed in CHARGER_CTRL_REG.TBAT_MONITOR_MODE bit-field. The encoding of the states is as follows:
0x0 = CHECK_IDLE
0x1 = CHECK_THOT
0x2 = CHECK_TCOLD
0x3 = CHECK_TWARM
0x4 = CHECK_TCOOL
0x5 = CHECK_TNORMAL
0x6 = UPDATE_TBAT
The FSM initially is in CHECK_IDLE state and starts checking the battery's temperature by visiting the states that check for the respective temperature area (Hot, Cold, Warm, Cool, Normal), in this order.
If the battery temperature is found to be in one of the aforementioned zones, it directly moves to UPDATE_TBAT state, to update the battery temperature's state and notify the main FSM of the Charger about the battery temperature status, before returning to the CHECK_IDLE state. A Charger State IRQ will also be generated upon refreshing the battery temperature status (see also the description of CHARGER_STATE_IRQ_MASK_REG register).</description>
	<bitRange>[20:18]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>CHARGER_STATE</name>
	<description>Indicating the state of the Charger's main FSM, based on the following encoding:
0x0 = POWER_UP (Charger's power-up not yet set)
0x1 = INIT (Charger is being power-up, FSM waiting for the analogue to settle)
0x2 = DISABLED (Charger powered-up but charging not yet started)
0x3 = PRE_CHARGE (Pre-Charge state)
0x4 = CC_CHARGE (Constant Current state)
0x5 = CV_CHARGE (Constant Voltage state)
0x6 = END_OF_CHARGE (End-of-Charge state)
0x7 = TDIE_PROT (Die temperature protection state, visited when Die temperature limit is exceeded)
0x8 = TBAT_PROT (Battery temperature protection state, visited when Battery temperature is either COLD or HOT)
0x9 = BYPASSED (Bypassed state, visited only when the FSM is bypassed and SW takes over control)
0xA = ERROR (Error state, visited when a charge time-out occurs or in the case of Vbat exceeding over-voltage level)</description>
	<bitRange>[17:14]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>TBAT_STATUS</name>
	<description>Battery pack temperature status, according to the following (&quot;1-Hot&quot;-like) encoding:
00001 : Battery temperature in COLD zone (default)
00010 : Battery temperature in COOL zone
00100 : Battery temperature in NORMAL zone (above COOL and below WARM zones)
01000 : Battery temperature in WARM zone
10000 : Battery temperature in HOT zone
It is noted that, according to the JEITA standard (supported if the JEITA_SUPPORT_ENABLED bit-field of CHARGER_CTRL_REG is not set) , if the battery pack temperature is in the &quot;HOT&quot; zone, charging will always be stopped. The same will happen also for the case of the COLD zone, unless the &quot;NTC_LOW_DISABLE&quot; bit-field of CHARGER_CTRL_REG is set. In that case, charging will continue.
It is finally noted that only the aforementioned values are available for this bit-field, since it is 1-Hot encoding based. Not more than 1 bit can be high at the same time, since this would mean that battery temperature is at two different temperature zones concurrently.</description>
	<bitRange>[13:9]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>MAIN_TBAT_COMP_OUT</name>
	<description>Returns the status of the main battery temperature comparator. This comparator by default checks if the battery temperature is in the Cold zone. However, if JEITA support is enabled and battery temperature is found to not be in either the Hot or the Cold zone, the same comparator is used to check for the Warm and Cool zones, as JEITA suggests.
The specific bit-field is suggested to be used in bypass mode and when the JEITA support is disabled (so when the battery temperature is checked agains the Hot and the Cold zones). In that case, the comparator checks the battery temperature agains the Cold level and its status can be as follows:
0 = Battery temperature pack is found to be below the Cold level, so in the non-allowed Cold temperature zone. Thus, charging will be disabled, provided that the NTC_LOW_DISABLE bit-field of CHARGER_CTRL_REG is not set.
1 = Battery temperature pack is found to be above the non-allowed Cold temperature zone. Thus, charging will be continued, provided that battery temperature will not be in the Hot zone as well.
When the Charger's main FSM is active and JEITA is enabled, the Charger's digital block takes over and controls the respective comparator's output.</description>
	<bitRange>[8:8]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>TBAT_HOT_COMP_OUT</name>
	<description>Returns the status of the battery temperature comparator dedicated to the Hot temperature zone.
0 = Battery temperature pack is found to be below the Hot zone
1 = Battery temperature pack is found to be in the non-allowed Hot temperature zone. Thus, charging will be disabled, provided that battery temperature protection is enabled.</description>
	<bitRange>[7:7]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>TDIE_COMP_OUT</name>
	<description>0 = Die temperature is found to be below the programmed level, set in CHARGER_TEMPSET_PARAM_REG.TDIE_SET level (normal operation)
1 = Die temperature is found to be above the set level.
Charging will be disabled if Die temperature protection is enabled and the Die temperature is found to be above the set level four consecutive times (see also TDIE_ERROR_DEBOUNCE_CNT bit-field). In that case, the Charger's FSM will also move the respective error state (TDIE_PROT) and an IRQ may be generated, if the respective mask bit of CHARGER_ERROR_IRQ_MASK_REG is set.</description>
	<bitRange>[6:6]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>VBAT_OVP_COMP_OUT</name>
	<description>0 = Vbat has not exceeded the Over-Voltage Protection (OVP) voltage limit, according to the respective analogue comparator's output.
1 = Vbat is found to have exceeded the OVP voltage setting, thus charging should be disabled.
The OVP voltage settings are defined in CHARGER_VOLTAGE_PARAM_REG.V_OVP (for the Normal battery temperature zone), as well as in CHARGER_JEITA_V_OVP_REG (for Cool and Warm temperature zones, to comply with JEITA). </description>
	<bitRange>[5:5]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>MAIN_VBAT_COMP_OUT</name>
	<description>This bit-field reflects the status of the main Vbat comparator residing in the analogue circuitry of the Charger.
This comparator is used to check Vbat against either the Pre-Charge or the Replenish voltage level, depending on what is driven by the Charger's digital block.
Thus, when the FSM is active, the comparator gets as reference the Replenish setting as soon as the FSM has reached the END_OF_CHARGE state. Otherwise,the Pre-Charge voltage setting is driven, including the Bypass mode.
According to the above, the encoding is as follows for the case the comparator compares Vbat against the Pre-Charge level:
0 = Vbat has not exceeded the set Pre-Charge voltage level.
1 = Vbat has reached or exceeded the set Pre-Charge voltage level.
For the case the comparator compares agains the Replenish level (when the FSM has reached the END_OF_CHARGE state, so when the charging has been completed), the encoding is as follows:
0 = Vbat has dropped below the set Replenish level, so charging will re-start and the FSM will move to the PRE_CHARGE state.
1 = Vbat is still greater or equal to the set Replenish level, thus charging remains in hold and the FSM in END_OF_CHARGE state.</description>
	<bitRange>[4:4]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>END_OF_CHARGE</name>
	<description>0 = Actual charge current is above the current level programmed in I_END_OF_CHARGE field of CHARGER_CURRENT_PARAM_REG (or charger is off)
1 = Actual charge current is below the current level programmed in I_END_OF_CHARGE bit-field of CHARGER_CURRENT_PARAM_REG.</description>
	<bitRange>[3:3]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>CHARGER_CV_MODE</name>
	<description>0 = Charger's voltage loop not in regulation (or Charger is off)
1 = Charger's Constant Voltage (CV) mode active, voltage loop in regulation</description>
	<bitRange>[2:2]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>CHARGER_CC_MODE</name>
	<description>0 = Charger's Current loop not in regulation (or Charger is off)
1 = Charger's Constant Current (CC) mode active, current loop in regulation</description>
	<bitRange>[1:1]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>CHARGER_IS_POWERED_UP</name>
	<description>0 = Charger is either off or it is being powered-on but the analogue ciruitry is not yet settled. The charger's main FSM is either in POWER_UP or INIT states.
1 = Charger is powered-up, so its analogue ciruitry should now be settled. The Charger's FSM has left both power-up states (POWER_UP, INIT), so charging can start.</description>
	<bitRange>[0:0]</bitRange>
