nguyentri/da-pac/svd/DA14699.svd
	<registers>
	<register>
	<name>CHIP_ID1_REG</name>
	<description>Chip identification register 1.</description>
	<addressOffset>0x00000000</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000032</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>CHIP_ID1</name>
	<description>First character of device type &quot;2522&quot; in ASCII. </description>
	<bitRange>[7:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>CHIP_ID2_REG</name>
	<description>Chip identification register 2.</description>
	<addressOffset>0x00000004</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000035</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>CHIP_ID2</name>
	<description>Second character of device type &quot;2522&quot; in ASCII. </description>
	<bitRange>[7:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>CHIP_ID3_REG</name>
	<description>Chip identification register 3.</description>
	<addressOffset>0x00000008</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000032</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>CHIP_ID3</name>
	<description>Third character of device type &quot;2522&quot; in ASCII. </description>
	<bitRange>[7:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>CHIP_ID4_REG</name>
	<description>Chip identification register 4.</description>
	<addressOffset>0x0000000c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000032</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>CHIP_ID4</name>
	<description>Fourth character of device type &quot;2522&quot; in ASCII.</description>
	<bitRange>[7:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>CHIP_REVISION_REG</name>
	<description>Chip revision register.</description>
	<addressOffset>0x00000014</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000041</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>CHIP_REVISION</name>
	<description>Chip version, corresponds with type number in ASCII.
0x41 = 'A', 0x42 = 'B' </description>
	<bitRange>[7:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>CHIP_SWC_REG</name>
	<description>Software compatibility register.</description>
	<addressOffset>0x00000010</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>CHIP_SWC</name>
	<description>SoftWare Compatibility code.
Integer (default = 0) which is incremented if a silicon change has impact on the CPU Firmware.
Can be used by software developers to write silicon revision dependent code. </description>
	<bitRange>[3:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>CHIP_TEST1_REG</name>
	<description>Chip test register 1.</description>
	<addressOffset>0x000000f8</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000042</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>CHIP_LAYOUT_REVISION</name>
	<description>Chip layout revision, corresponds with type number in ASCII.
0x41 = 'A', 0x42 = 'B' </description>
	<bitRange>[7:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>CHIP_TEST2_REG</name>
	<description>Chip test register 2.</description>
	<addressOffset>0x000000fc</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>CHIP_METAL_OPTION</name>
	<description>Chip metal option value.</description>
	<bitRange>[3:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>CMAC</name>
	<version>1.0</version>
	<description>CMAC registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x40000000</baseAddress>
	<size>0</size>
	<addressBlock>
	<offset>0</offset>
	<size>8464</size>
	<usage>registers</usage>
</addressBlock>
	
	<registers>
	<register>
	<name>CM_CTRL_SYS_REG</name>
	<description>CMAC and System Control Register</description>
	<addressOffset>0x00002000</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x7fffffff</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>CMAC_CONST_1</name>
	<description>Always read as &quot;1&quot;.
Note: Creating an always non-zero register value, making easier a visual check of register when power domain is off.</description>
	<bitRange>[31:31]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>CMAC_LOCKUP_STATE</name>
	
	<bitRange>[15:15]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>CMAC_WDOG_EXPIRE_STATE</name>
	
	<bitRange>[14:14]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>CMAC_SYSMEMCTRL_ERROR_STATE</name>
	
	<bitRange>[13:13]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>CMAC_CPU_ERROR_STATE</name>
	
	<bitRange>[12:12]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>CMAC_BS_ERROR_STATE</name>
	
	<bitRange>[11:11]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>CMAC_FW_ERROR_STATE</name>
	
	<bitRange>[10:10]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>MCPU_SLEEPING_STATE</name>
	
	<bitRange>[9:9]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>CMAC_RST_MCPU_STATE</name>
	<description>The state of the CMAC M0+ reset signal.
Note that this reset is driven also by CLK_RADIO_REG-&gt;CMAC_SYNCH_RESET.</description>
	<bitRange>[8:8]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>CMAC_RST_BS_STATE</name>
	
	<bitRange>[7:7]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>CMAC2SYS_IRQ_CLR</name>
	<description>Writing &quot;0&quot; will have no effect.
Writing &quot;1&quot; will clear the CMAC2SYS_IRQ, a process that depends on the state of CMAC and the relationship of the PCLK and CMAC clocks.
Reading will return &quot;1&quot; as long as the clearing process is pending, otherwise it will return &quot;0&quot;.</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CMAC2SYS_IRQ_STATE</name>
	<description>The current state of the CMAC2SYS_IRQ signal.</description>
	<bitRange>[0:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>CM_DIAG_IRQ1_EDGE_REG</name>
	<description>Diagnostic IRQ on Word1 - Edge Register</description>
	<addressOffset>0x00002104</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>DIAG1_PHY_TX_EN_RFCU</name>
	<description>Refer to bit 0.</description>
	<bitRange>[7:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DIAG1_PHY_RX_EN_RFCU</name>
	<description>Refer to bit 0.</description>
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DIAG1_DCF_26</name>
	<description>Refer to bit 0.</description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DIAG1_DCF_25</name>
	<description>Refer to bit 0.</description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DIAG1_DCF_24</name>
	<description>Refer to bit 0.</description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DIAG1_DCF_23</name>
	<description>Refer to bit 0.</description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DIAG1_DCF_22</name>
	<description>Refer to bit 0.</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DIAG1_DCF_21</name>
	<description>0: The positive edge is selected to set the corresponding bit of CM_DIAG_IRQ1_STAT_REG.
1: The negative edge is selected.</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>CM_DIAG_IRQ1_MASK_REG</name>
	<description>Diagnostic IRQ on Word1 - Mask Register</description>
	<addressOffset>0x0000210c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>DIAG1_SIGNAL_DETECTED</name>
	<description>Refer to bit 0.</description>
	<bitRange>[10:10]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DIAG1_MATCH0101</name>
	<description>Refer to bit 0.</description>
	<bitRange>[9:9]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DIAG1_SYNC_FOUND</name>
	<description>Refer to bit 0.</description>
	<bitRange>[8:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DIAG1_PHY_TX_EN_RFCU</name>
	<description>Refer to bit 0.</description>
	<bitRange>[7:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DIAG1_PHY_RX_EN_RFCU</name>
	<description>Refer to bit 0.</description>
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DIAG1_DCF_26</name>
	<description>Refer to bit 0.</description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DIAG1_DCF_25</name>
	<description>Refer to bit 0.</description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DIAG1_DCF_24</name>
	<description>Refer to bit 0.</description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DIAG1_DCF_23</name>
	<description>Refer to bit 0.</description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DIAG1_DCF_22</name>
	<description>Refer to bit 0.</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DIAG1_DCF_21</name>
	<description>1: Raise an DIAG_IRQ when the corresponding bit of CM_DIAG_IRQ1_STAT_REG is also &quot;1&quot;.
0: Mask the state of the corresponding bit of CM_DIAG_IRQ1_STAT_REG in order to not trigger DIAG_IRQ.</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>CM_DIAG_IRQ1_STAT_REG</name>
	<description>Diagnostic IRQ on Word1 - Status Register</description>
	<addressOffset>0x00002108</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>DIAG1_SIGNAL_DETECTED</name>
	<description>Refer to bit 0.</description>
	<bitRange>[10:10]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DIAG1_MATCH0101</name>
	<description>Refer to bit 0.</description>
	<bitRange>[9:9]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DIAG1_SYNC_FOUND</name>
	<description>Refer to bit 0.</description>
	<bitRange>[8:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DIAG1_PHY_TX_EN_RFCU</name>
	<description>Refer to bit 0.</description>
	<bitRange>[7:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DIAG1_PHY_RX_EN_RFCU</name>
	<description>Refer to bit 0.</description>
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DIAG1_DCF_26</name>
	<description>Refer to bit 0.</description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DIAG1_DCF_25</name>
	<description>Refer to bit 0.</description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DIAG1_DCF_24</name>
	<description>Refer to bit 0.</description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DIAG1_DCF_23</name>
	<description>Refer to bit 0.</description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DIAG1_DCF_22</name>
	<description>Refer to bit 0.</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DIAG1_DCF_21</name>
	<description>1: the corresponding event is pending.
0: the corresponding event is not pending.
Writing a '1' will clear the corresponding bit.
Writing a '0' into a bit will have no effect.
Use this register to detect and acknowledge the source that triggers the DIAG_IRQ.</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>CM_DIAG_IRQ1_WORD_REG</name>
	<description>Diagnostic IRQ on Word1 - Word1 Register</description>
	<addressOffset>0x00002100</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>DIAG1_SIGNAL_DETECTED</name>
	<description>Refer to bit 0.</description>
	<bitRange>[10:10]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DIAG1_MATCH0101</name>
	<description>Refer to bit 0.</description>
	<bitRange>[9:9]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DIAG1_SYNC_FOUND</name>
	<description>Refer to bit 0.</description>
	<bitRange>[8:8]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DIAG1_PHY_TX_EN_RFCU</name>
	<description>Refer to bit 0.</description>
	<bitRange>[7:7]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DIAG1_PHY_RX_EN_RFCU</name>
	<description>Refer to bit 0.</description>
	<bitRange>[6:6]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DIAG1_DCF_26</name>
	<description>Refer to bit 0.</description>
	<bitRange>[5:5]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DIAG1_DCF_25</name>
	<description>Refer to bit 0.</description>
	<bitRange>[4:4]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DIAG1_DCF_24</name>
	<description>Refer to bit 0.</description>
	<bitRange>[3:3]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DIAG1_DCF_23</name>
	<description>Refer to bit 0.</description>
	<bitRange>[2:2]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DIAG1_DCF_22</name>
	<description>Refer to bit 0.</description>
	<bitRange>[1:1]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DIAG1_DCF_21</name>
	<description>Same signal as the one in CM_DIAG_WORD1_REG.
Refer to CM_DIAG_WORD1_REG for signal description.</description>
	<bitRange>[0:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>CM_WDOG_REG</name>
	<description>CMAC Watch Dog Control Register</description>
	<addressOffset>0x00002004</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00001fff</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>SYS2CMAC_WDOG_FREEZE</name>
	<description>A read-only copy of SET_FREEZE_REG-&gt;FRZ_CMAC_WDOG value.</description>
	<bitRange>[31:31]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>SYS2CMAC_WDOG_FREEZE_DIS</name>
	<description>Setting to '1' will mask the SYS2CMAC_WDOG_FREEZE, which is provided by SET_FREEZE_REG-&gt;FRZ_CMAC_WDOG.
Setting to &quot;1&quot; can be done only by writing at the same time CM_WDOG_WRITE_VALID with ones.
The field can be only set to '1', so it can be set during the initilization and it will not change during the reloadings.
It can be reseted either via power cycling the Power Domain or via the CLK_RADIO_REG-&gt;CMAC_SYNCH_RESET.</description>
	<bitRange>[30:30]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CM_WDOG_EXPIRE</name>
	<description>This bit automatically is set to &quot;1&quot; as soon as CM_WDOG_CNT=0, causing CM_WDOG_CNT to start counting again from the value of &quot;16&quot; and also asserting CM_ERROR_REG-&gt;CM_WDOG_EXPIRE_ERR.
If the SW will write CM_WDOG_EXPIRE = 0 and CM_WDOG_CNT=0, then at the next WDOG clock cycle the CM_WDOG_EXPIRE will automatically be set to to &quot;1&quot;.
If the SW will write CM_WDOG_EXPIRE = 1 and CM_WDOG_CNT=0, then at the next WDOG clock cycle the CM_WDOG_SYS_RST_REQ will automatically be set to &quot;1&quot;.
The CM_WDOG_SYS_RST_REQ will reset the system and will update the RESET_STAT_REG-&gt;CMAC_WDOGRESET_STAT.
Refer also to CM_EXC_STAT_REG-&gt;EXC_WDOG_EARLY.</description>
	<bitRange>[29:29]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CM_WDOG_SYS_RST_REQ</name>
	<description>Refer to CM_WDOG_EXPIRE.</description>
	<bitRange>[28:28]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>CM_WDOG_WRITE_VALID</name>
	<description>In order to allow a write of any of the remaining fields, this value must be also written simultaneously with the value &quot;3&quot;.
Reading this field will return always '0'.</description>
	<bitRange>[18:17]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>CM_WDOG_CNT</name>
	<description>Provides access to the counter, which counts down every 10.24 msec.
FW should reload the WDOG counter by writing to CM_WDOG_REG the value (CM_WDOG_CNT | CM_WDOG_WRITE_VALID), i.e. write can be done only by writing at the same time CM_WDOG_WRITE_VALID with ones.
The counter will start counting immediately after the power up of the Power Domain.</description>
	<bitRange>[12:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>CMAC_TIMER_SLP</name>
	<version>1.0</version>
	<description>CMAC_TIMER_SLP registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x50010400</baseAddress>
	<size>0</size>
	<addressBlock>
	<offset>0</offset>
	<size>12</size>
	<usage>registers</usage>
</addressBlock>
	
