nguyentri/da-pac/svd/DA14699.svd
	<registers>
	<register>
	<name>CM_SLP_CTRL2_REG</name>
	<description>CMAC Sleep Control 2 (no RMW)</description>
	<addressOffset>0x00000004</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>CMAC_WAKEUP_ON_SWD_STATE</name>
	<description>Provides the current state of CMAC_WAKEUP_ON_SWD.
Writing '1' will clear this bit.
Writing '0' has no effect.
When CM_SLP_CTRL_REG-&gt;CMAC_WAKEUP_ON_SWD_EN=1 and the Radio Power Domain is down and SYS_CTRL_REG-&gt;CMAC_DEBUGGER_ENABLE=1 then any negative edge on SWDCLK pin will set the CMAC_WAKEUP_ON_SWD.
The CMAC_WAKEUP_ON_SWD logically OR-ed with SLP_TIMER_IRQ is connected to PDC and thus it is able to wake up the CMAC, allowing the connection of CMAC Cortex with the debugger.
Note: If the pins are not used as CMAC SWD, then keep SYS_CTRL_REG-&gt;CMAC_DEBUGGER_ENABLE=0 to avoid false wakeup triggers.</description>
	<bitRange>[8:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SLP_TIMER_ACTIVE</name>
	<description>Refer to CM_SLP_CTRL_REG-&gt;SLP_TIMER_ACTIVE</description>
	<bitRange>[7:7]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>LP_CLK_STATE</name>
	<description>Refer to CM_SLP_CTRL_REG-&gt;LP_CLK_STATE.</description>
	<bitRange>[6:6]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>SLP_TIMER_CNT_SIGN</name>
	<description>Timer sign</description>
	<bitRange>[5:5]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>SLP_TIMER_IRQ_SET</name>
	<description>Writing '1' will cause the IRQ to be set. This field remains to '1' until the IRQ is set.
Writing '0' has no effect.
System CPU SW may use this field to force CMAC to wakeup through SLP_TIMER.
Note that typically SW wakes up CMAC through the SYS2CMAC_IRQ (via PDC).</description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SLP_TIMER_IRQ_CLR</name>
	<description>Writing '1' will cause the IRQ to be cleared. This field remains to '1' until the IRQ is cleared.
Writing '0' has no effect.
Note that clearing the IRQ is not possible as long as the Timer is &quot;1&quot;, since the Expire event has higher priority.</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SLP_TIMER_IRQ_STATE</name>
	<description>Provides the current state of the CMAC Sleep Timer IRQ.</description>
	<bitRange>[0:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>CM_SLP_CTRL_REG</name>
	<description>CMAC Sleep Control 1 (allowed to RMW)</description>
	<addressOffset>0x00000000</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>CMAC_WAKEUP_ON_SWD_EN</name>
	<description>If '1' then enable the generation of CMAC_WAKEUP_ON_SWD.</description>
	<bitRange>[24:24]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TCLK_FROM_LPCLK</name>
	<description>T Clock</description>
	<bitRange>[9:9]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TCLK_FROM_PCLK</name>
	<description>T Clock</description>
	<bitRange>[8:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SLP_TIMER_ACTIVE</name>
	<description>Refer to SLP_TIMER_SW</description>
	<bitRange>[7:7]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>LP_CLK_STATE</name>
	<description>LP_CLK state</description>
	<bitRange>[6:6]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>SLP_TIMER_CNT_SIGN</name>
	<description>Refer to CM_SLP_CTRL2_REG-&gt;SLP_TIMER_CNT_SIGN.</description>
	<bitRange>[5:5]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>SLP_TIMER_SW</name>
	<description>Timer SW</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>CM_SLP_TIMER_REG</name>
	<description>CMAC Sleep Timer</description>
	<addressOffset>0x00000008</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>CM_SLP_TIMER_VALUE</name>
	<description>Timer value</description>
	<bitRange>[31:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>CRG_COM</name>
	<version>1.0</version>
	<description>CRG_COM registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x50020900</baseAddress>
	<size>0</size>
	<addressBlock>
	<offset>0</offset>
	<size>16</size>
	<usage>registers</usage>
</addressBlock>
	
	<registers>
	<register>
	<name>CLK_COM_REG</name>
	<description>Peripheral divider register</description>
	<addressOffset>0x00000004</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00030000</resetValue>
	<resetMask>0x0003ffff</resetMask>
	<fields><field>
	<name>LCD_EXT_CLK_SEL</name>
	<description>Select LCD external clock speed.
0x0: 1 Hz
0x1: 62.5 Hz
0x2: 125 Hz
0x3: off</description>
	<bitRange>[17:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SNC_DIV</name>
	<description>Division factor for SNC, w.r.t. pclk setting
0x0 = divide by 1
0x1 = divide by 2
0x2 = divide by 4
0x3 = divide by 8 </description>
	<bitRange>[15:14]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>I2C2_CLK_SEL</name>
	<description>Selects the clock source
1 = DIV1 clock
0 = DIVN clock</description>
	<bitRange>[12:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>I2C2_ENABLE</name>
	<description>Enables the clock</description>
	<bitRange>[11:11]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>I2C_CLK_SEL</name>
	<description>Selects the clock source
1 = DIV1 clock
0 = DIVN clock</description>
	<bitRange>[10:10]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>I2C_ENABLE</name>
	<description>Enables the clock</description>
	<bitRange>[9:9]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SPI2_CLK_SEL</name>
	<description>Selects the clock source
1 = DIV1 clock
0 = DIVN clock</description>
	<bitRange>[8:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SPI2_ENABLE</name>
	<description>Enables the clock</description>
	<bitRange>[7:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SPI_CLK_SEL</name>
	<description>Selects the clock source
1 = DIV1 clock
0 = DIVN clock</description>
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SPI_ENABLE</name>
	<description>Enables the clock</description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>UART3_CLK_SEL</name>
	<description>Selects the clock source
1 = DIV1 clock
0 = DIVN clock</description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>UART3_ENABLE</name>
	<description>Enables the clock</description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>UART2_CLK_SEL</name>
	<description>Selects the clock source
1 = DIV1 clock
0 = DIVN clock</description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>UART2_ENABLE</name>
	<description>Enables the clock</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>UART_ENABLE</name>
	<description>Enables the clock</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RESET_CLK_COM_REG</name>
	<description>Peripheral divider register RESET register. Reads back 0x0000</description>
	<addressOffset>0x0000000c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0003ffff</resetMask>
	<fields><field>
	<name>LCD_EXT_CLK_SEL</name>
	<description>Select LCD external clock speed.
0x0: 1 Hz
0x1: 62.5 Hz
0x2: 125 Hz
0x3: off</description>
	<bitRange>[17:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SNC_DIV</name>
	<description>Division factor for SNC, w.r.t. pclk setting
0x0 = divide by 1
0x1 = divide by 2
0x2 = divide by 4
0x3 = divide by 8 </description>
	<bitRange>[15:14]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SDADC_CLK_SEL</name>
	<description>Selects the clock source
1 = DIV1 clock
0 = DIVN clock</description>
	<bitRange>[13:13]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>I2C2_CLK_SEL</name>
	<description>Selects the clock source
1 = DIV1 clock
0 = DIVN clock</description>
	<bitRange>[12:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>I2C2_ENABLE</name>
	<description>Enables the clock</description>
	<bitRange>[11:11]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>I2C_CLK_SEL</name>
	<description>Selects the clock source
1 = DIV1 clock
0 = DIVN clock</description>
	<bitRange>[10:10]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>I2C_ENABLE</name>
	<description>Enables the clock</description>
	<bitRange>[9:9]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SPI2_CLK_SEL</name>
	<description>Selects the clock source
1 = DIV1 clock
0 = DIVN clock</description>
	<bitRange>[8:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SPI2_ENABLE</name>
	<description>Enables the clock</description>
	<bitRange>[7:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SPI_CLK_SEL</name>
	<description>Selects the clock source
1 = DIV1 clock
0 = DIVN clock</description>
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SPI_ENABLE</name>
	<description>Enables the clock</description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>UART3_CLK_SEL</name>
	<description>Selects the clock source
1 = DIV1 clock
0 = DIVN clock</description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>UART3_ENABLE</name>
	<description>Enables the clock</description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>UART2_CLK_SEL</name>
	<description>Selects the clock source
1 = DIV1 clock
0 = DIVN clock</description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>UART2_ENABLE</name>
	<description>Enables the clock</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>UART_ENABLE</name>
	<description>Enables the clock</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>SET_CLK_COM_REG</name>
	<description>Peripheral divider register SET register. Reads back 0x0000</description>
	<addressOffset>0x00000008</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0003ffff</resetMask>
	<fields><field>
	<name>LCD_EXT_CLK_SEL</name>
	<description>Select LCD external clock speed.
0x0: 1 Hz
0x1: 62.5 Hz
0x2: 125 Hz
0x3: off</description>
	<bitRange>[17:16]</bitRange>
	<access>read-writeonce</access>
	</field><field>
	<name>SNC_DIV</name>
	<description>Division factor for SNC, w.r.t. pclk setting
0x0 = divide by 1
0x1 = divide by 2
0x2 = divide by 4
0x3 = divide by 8 </description>
	<bitRange>[15:14]</bitRange>
	<access>read-writeonce</access>
	</field><field>
	<name>SDADC_CLK_SEL</name>
	<description>Selects the clock source
1 = DIV1 clock
0 = DIVN clock</description>
	<bitRange>[13:13]</bitRange>
	<access>read-writeonce</access>
	</field><field>
	<name>I2C2_CLK_SEL</name>
	<description>Selects the clock source
1 = DIV1 clock
0 = DIVN clock</description>
	<bitRange>[12:12]</bitRange>
	<access>read-writeonce</access>
	</field><field>
	<name>I2C2_ENABLE</name>
	<description>Enables the clock</description>
	<bitRange>[11:11]</bitRange>
	<access>read-writeonce</access>
	</field><field>
	<name>I2C_CLK_SEL</name>
	<description>Selects the clock source
1 = DIV1 clock
0 = DIVN clock</description>
	<bitRange>[10:10]</bitRange>
	<access>read-writeonce</access>
	</field><field>
	<name>I2C_ENABLE</name>
	<description>Enables the clock</description>
	<bitRange>[9:9]</bitRange>
	<access>read-writeonce</access>
	</field><field>
	<name>SPI2_CLK_SEL</name>
	<description>Selects the clock source
1 = DIV1 clock
0 = DIVN clock</description>
	<bitRange>[8:8]</bitRange>
	<access>read-writeonce</access>
	</field><field>
	<name>SPI2_ENABLE</name>
	<description>Enables the clock</description>
	<bitRange>[7:7]</bitRange>
	<access>read-writeonce</access>
	</field><field>
	<name>SPI_CLK_SEL</name>
	<description>Selects the clock source
1 = DIV1 clock
0 = DIVN clock</description>
	<bitRange>[6:6]</bitRange>
	<access>read-writeonce</access>
	</field><field>
	<name>SPI_ENABLE</name>
	<description>Enables the clock</description>
	<bitRange>[5:5]</bitRange>
	<access>read-writeonce</access>
	</field><field>
	<name>UART3_CLK_SEL</name>
	<description>Selects the clock source
1 = DIV1 clock
0 = DIVN clock</description>
	<bitRange>[4:4]</bitRange>
	<access>read-writeonce</access>
	</field><field>
	<name>UART3_ENABLE</name>
	<description>Enables the clock</description>
	<bitRange>[3:3]</bitRange>
	<access>read-writeonce</access>
	</field><field>
	<name>UART2_CLK_SEL</name>
	<description>Selects the clock source
1 = DIV1 clock
0 = DIVN clock</description>
	<bitRange>[2:2]</bitRange>
	<access>read-writeonce</access>
	</field><field>
	<name>UART2_ENABLE</name>
	<description>Enables the clock</description>
	<bitRange>[1:1]</bitRange>
	<access>read-writeonce</access>
	</field><field>
	<name>UART_ENABLE</name>
	<description>Enables the clock</description>
	<bitRange>[0:0]</bitRange>
	<access>read-writeonce</access>
	</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>CRG_PER</name>
	<version>1.0</version>
	<description>CRG_PER registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x50030c00</baseAddress>
	<size>0</size>
	<addressBlock>
	<offset>0</offset>
	<size>80</size>
	<usage>registers</usage>
</addressBlock>
	
