nguyentri/da-pac/svd/DA14699.svd
	<registers>
	<register>
	<name>CLK_FREQ_TRIM_REG</name>
	<description>Xtal frequency trimming register.</description>
	<addressOffset>0x00000000</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x2bfafd70</resetValue>
	<resetMask>0x3fffffff</resetMask>
	<fields><field>
	<name>XTAL32M_START</name>
	<description>Xtal frequency trimming register - START phase of startup
0x2BF = lowest frequency (high load capacitance)
0x000 = highest frequency (low load capacitance)
Cload = 5.0p + 6.09p * XTAL32M_TRIM/0x2BF- this includes the PCB parasitic capacitances of the reference desing</description>
	<bitRange>[29:20]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>XTAL32M_RAMP</name>
	<description>Xtal frequency trimming register - RAMP phase of startup.
0x2BF = lowest frequency (high load capacitance)
0x000 = highest frequency (low load capacitance)
Cload = 5.0p + 6.09p * XTAL32M_TRIM/0x2BF- this includes the PCB parasitic capacitances of the reference desing</description>
	<bitRange>[19:10]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>XTAL32M_TRIM</name>
	<description>Xtal frequency trimming register.
0x2BF = lowest frequency (high load capacitance)
0x000 = highest frequency (low load capacitance)
Cload = 5.0p + 6.09p * XTAL32M_TRIM/0x2BF- this includes the PCB parasitic capacitances of the reference desing</description>
	<bitRange>[9:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>PLL_SYS_STATUS_REG</name>
	<description>System PLL status register.</description>
	<addressOffset>0x00000070</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>LDO_PLL_OK</name>
	<description>1: Indicates that LDO PLL is in regulation.</description>
	<bitRange>[15:15]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>PLL_CALIBRATION_END</name>
	<description>Indicates that calibration has finished.</description>
	<bitRange>[11:11]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>PLL_BEST_MIN_CUR</name>
	<description>Calibrated VCO current.</description>
	<bitRange>[10:5]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>PLL_LOCK_FINE</name>
	<description>1: PLL locked </description>
	<bitRange>[0:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>TRIM_CTRL_REG</name>
	<description>Control trimming of the XTAL32M</description>
	<addressOffset>0x00000010</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000522</resetValue>
	<resetMask>0x00003fff</resetMask>
	<fields><field>
	<name>XTAL_SETTLE_N</name>
	<description>Designates that the XTAL can be safely used as the CPU clock. When XTAL_CLK_CNT reases this value, the signal XTAL_SETTLE_READY will be set</description>
	<bitRange>[13:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>XTAL_TRIM_SELECT</name>
	<description>Select which source controls the XTAL trimming
0b00: xtal counter. Starts CLK_FREQ_TRIM_REG[XTAL32M_START] after COUNT_N * 32 xtal pulses trim is changed to CLK_FREQ_TRIM_REG[XTAL32M_TRIM].
0b01: xtal OK filter. Starts with CLK_FREQ_TRIM_REG[XTAL32M_START], when xtal is ramping is changed to CLK_FREQ_TRIM_REG[XTAL32M_TRIM].
0b10: statically forced off. Only uses CLK_FREQ_TRIM_REG[XTAL32M_TRIM].
0b11: xtal OK filter, 2 stage. Starts with CLK_FREQ_TRIM_REG[XTAL32M_START] switches to CLK_FREQ_TRIM_REG[XTAL32M_RAMP] after timeout (sw1='1', XTAL32M_CTRL0_REG[XTAL32M_SW_DELAY]), and switches to CLK_FREQ_TRIM_REG[XTAL32M_TRIM] when sw2='1'.</description>
	<bitRange>[7:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>XTAL_COUNT_N</name>
	<description>Defines the number of XTAL cycles to be counted, before the xtal trimming is applied, in steps of 32.
0x01: 32
0x02: 64
0x3f:2016 </description>
	<bitRange>[5:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>XTALRDY_CTRL_REG</name>
	<description>Control register for XTALRDY IRQ</description>
	<addressOffset>0x00000018</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000100</resetValue>
	<resetMask>0x000001ff</resetMask>
	<fields><field>
	<name>XTALRDY_CLK_SEL</name>
	<description>XTALRDY IRQ timer clock selection:
0: 32KHz
1: 256kHz</description>
	<bitRange>[8:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>XTALRDY_CNT</name>
	<description>Number of 32kHz or 256kHz cycles between the crystal is enabled, and the XTALRDY_IRQ is fired. Frequency set by XTALRDY_CLK_SEL.
0x00: no interrupt
</description>
	<bitRange>[7:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>DCDC</name>
	<version>1.0</version>
	<description>DCDC registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x50000300</baseAddress>
	<size>0</size>
	<addressBlock>
	<offset>0</offset>
	<size>60</size>
	<usage>registers</usage>
</addressBlock>
	
	<registers>
	<register>
	<name>DCDC_CTRL1_REG</name>
	<description>DCDC First Control Register</description>
	<addressOffset>0x00000004</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x7fffffff</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>DCDC_SH_ENABLE</name>
	<description>Enables sample and hold circuit in output comparators.</description>
	<bitRange>[31:31]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_STARTUP_DELAY</name>
	<description>Delay between turning bias on and converter becoming active
0 - 31 us, 1 us step size</description>
	<bitRange>[30:26]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_IDLE_MAX_FAST_DOWNRAMP</name>
	<description>Maximum output idle time for fast current limit downramping.
0 - 7875 ns, 125 ns step size</description>
	<bitRange>[25:20]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_SW_TIMEOUT</name>
	<description>P and N switch timeout, if switch is closed longer than this a timeout is generated and the FSM is forced to the next state
Writing 0 disables timeout functionality
62.5 - 1937.5 ns, 62.5 ns step size</description>
	<bitRange>[19:15]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_FAST_STARTUP</name>
	<description>Set current limit to maximum during initial startup</description>
	<bitRange>[14:14]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_MAN_LV_MODE</name>
	<description>Manually activates low voltage settings</description>
	<bitRange>[13:13]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_AUTO_LV_MODE</name>
	<description>Switches to low voltage settings when battery voltage drops below 2.5 V</description>
	<bitRange>[12:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_IDLE_CLK_DIV</name>
	<description>Idle Clock Divider
00 = 2
01 = 4
10 = 8
11 = 16</description>
	<bitRange>[11:10]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_PRIORITY</name>
	<description>Charge priority register (4x 2 bit ID)
Charge sequence is [1:0] &gt; [3:2] &gt; [5:4] &gt; [7:6]
V14 = 00
V18 = 01
VDD = 10
V18P = 11</description>
	<bitRange>[9:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_FW_ENABLE</name>
	<description>Freewheel switch enable</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_ENABLE</name>
	<description>Enable setting for DCDC converter</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>DCDC_CTRL2_REG</name>
	<description>DCDC Second Control Register</description>
	<addressOffset>0x00000008</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x080888df</resetValue>
	<resetMask>0x0fffffff</resetMask>
	<fields><field>
	<name>DCDC_V_NOK_CNT_MAX</name>
	<description>Maximum number of V_NOK events on an output before V_AVAILABLE is reset</description>
	<bitRange>[27:24]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_N_COMP_TRIM_MAN</name>
	<description>Enables manual trimming for N side comparator</description>
	<bitRange>[22:22]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_N_COMP_TRIM_VAL</name>
	<description>Manual trim value for N side comparator
Signed magnitude representation
011111 = +13 mV
000000 = 100000 = -22 mV
111111 = -56 mV</description>
	<bitRange>[21:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_TIMEOUT_IRQ_TRIG</name>
	<description>Number of timeout events before timeout interrupt is generated</description>
	<bitRange>[15:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_TIMEOUT_IRQ_RES</name>
	<description>Number of successive non-timed out charge events required to clear timeout event counter</description>
	<bitRange>[11:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_SLOPE_CONTROL</name>
	<description>Sets strength of N and P switch drivers</description>
	<bitRange>[7:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_VBTSTRP_TRIM</name>
	<description>Trim bootstrap voltage
V = 1.6 V + 100 mV * N</description>
	<bitRange>[5:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_LSSUP_TRIM</name>
	<description>Trim low side supply voltage
V = 2 V + 300 mV * N</description>
	<bitRange>[3:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_HSGND_TRIM</name>
	<description>Trim high side ground
V = VBAT - (2 V + 400 mV * N)</description>
	<bitRange>[1:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>DCDC_IRQ_CLEAR_REG</name>
	<description>DCDC Interrupt Clear Register</description>
	<addressOffset>0x00000034</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000001f</resetMask>
	<fields><field>
	<name>DCDC_LOW_VBAT_IRQ_CLEAR</name>
	<description>Clear low VBAT interrupt</description>
	<bitRange>[4:4]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>DCDC_V18P_TIMEOUT_IRQ_CLEAR</name>
	<description>Clear V18P timeout interrupt</description>
	<bitRange>[3:3]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>DCDC_VDD_TIMEOUT_IRQ_CLEAR</name>
	<description>Clear VDD timeout interrupt</description>
	<bitRange>[2:2]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>DCDC_V18_TIMEOUT_IRQ_CLEAR</name>
	<description>Clear V18 timeout interrupt</description>
	<bitRange>[1:1]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>DCDC_V14_TIMEOUT_IRQ_CLEAR</name>
	<description>Clear V14 timeout interrupt</description>
	<bitRange>[0:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>DCDC_IRQ_MASK_REG</name>
	<description>DCDC Interrupt Mask Register</description>
	<addressOffset>0x00000038</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x0000000f</resetValue>
	<resetMask>0x0000001f</resetMask>
	<fields><field>
	<name>DCDC_LOW_VBAT_IRQ_MASK</name>
	<description>Mask low VBAT interrupt</description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_V18P_TIMEOUT_IRQ_MASK</name>
	<description>Mask V18P timeout interrupt</description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_VDD_TIMEOUT_IRQ_MASK</name>
	<description>Mask VDD timeout interrupt</description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_V18_TIMEOUT_IRQ_MASK</name>
	<description>Mask V18 timeout interrupt</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_V14_TIMEOUT_IRQ_MASK</name>
	<description>Mask V14 timeout interrupt</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>DCDC_IRQ_STATUS_REG</name>
	<description>DCDC Interrupt Status Register</description>
	<addressOffset>0x00000030</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000001f</resetMask>
	<fields><field>
	<name>DCDC_LOW_VBAT_IRQ_STATUS</name>
	<description>Low VBAT detector triggered (battery voltage below 2.5 V)</description>
	<bitRange>[4:4]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DCDC_V18P_TIMEOUT_IRQ_STATUS</name>
	<description>Timeout occured on V18P output</description>
	<bitRange>[3:3]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DCDC_VDD_TIMEOUT_IRQ_STATUS</name>
	<description>Timeout occured on VDD output</description>
	<bitRange>[2:2]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DCDC_V18_TIMEOUT_IRQ_STATUS</name>
	<description>Timeout occured on V18 output</description>
	<bitRange>[1:1]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DCDC_V14_TIMEOUT_IRQ_STATUS</name>
	<description>Timeout occured on V14 output</description>
	<bitRange>[0:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>DCDC_STATUS1_REG</name>
	<description>DCDC First Status Register</description>
	<addressOffset>0x00000020</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0fffffff</resetMask>
	<fields><field>
	<name>DCDC_V18P_AVAILABLE</name>
	<description>Indicates whether V18P is available
Requires that converter is enabled, output is enabled and V_OK has occured. Reset when too many V_NOK events have occured.</description>
	<bitRange>[27:27]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DCDC_VDD_AVAILABLE</name>
	<description>Indicates whether VDD is available
Requires that converter is enabled, output is enabled and V_OK has occured. Reset when too many V_NOK events have occured.</description>
	<bitRange>[26:26]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DCDC_V18_AVAILABLE</name>
	<description>Indicates whether V18 is available
Requires that converter is enabled, output is enabled and V_OK has occured. Reset when too many V_NOK events have occured.</description>
	<bitRange>[25:25]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DCDC_V14_AVAILABLE</name>
	<description>Indicates whether V14 is available
Requires that converter is enabled, output is enabled and V_OK has occured. Reset when too many V_NOK events have occured.</description>
	<bitRange>[24:24]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DCDC_V18P_COMP_OK</name>
	<description>OK output of V18P comparator</description>
	<bitRange>[23:23]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DCDC_VDD_COMP_OK</name>
	<description>OK output of VDD comparator</description>
	<bitRange>[22:22]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DCDC_V18_COMP_OK</name>
	<description>OK output of V18 comparator</description>
	<bitRange>[21:21]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DCDC_V14_COMP_OK</name>
	<description>OK output of V14 comparator</description>
	<bitRange>[20:20]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DCDC_V18P_COMP_NOK</name>
	<description>NOK output of V18P comparator</description>
	<bitRange>[19:19]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DCDC_VDD_COMP_NOK</name>
	<description>NOK output of VDD comparator</description>
	<bitRange>[18:18]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DCDC_V18_COMP_NOK</name>
	<description>NOK output of V18 comparator</description>
	<bitRange>[17:17]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DCDC_V14_COMP_NOK</name>
	<description>NOK output of V14 comparator</description>
	<bitRange>[16:16]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DCDC_N_COMP_P</name>
	<description>DCDC N side dynamic comparator P output</description>
	<bitRange>[11:11]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DCDC_N_COMP_N</name>
	<description>DCDC N side dynamic comparator N output</description>
	<bitRange>[10:10]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DCDC_P_COMP</name>
	<description>DCDC P side continuous time comparator output</description>
	<bitRange>[9:9]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DCDC_N_COMP</name>
	<description>DCDC N side continuous time comparator output</description>
	<bitRange>[8:8]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DCDC_LV_MODE</name>
	<description>Indicates if the converter is in low battery voltage mode</description>
	<bitRange>[7:7]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DCDC_V18P_SW_STATE</name>
	<description>DCDC state machine V18P output</description>
	<bitRange>[6:6]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DCDC_VDD_SW_STATE</name>
	<description>DCDC state machine VDD output</description>
	<bitRange>[5:5]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DCDC_V18_SW_STATE</name>
	<description>DCDC state machine V18 output</description>
	<bitRange>[4:4]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DCDC_V14_SW_STATE</name>
	<description>DCDC state machine V14 output</description>
	<bitRange>[3:3]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DCDC_N_SW_STATE</name>
	<description>DCDC state machine NSW output</description>
	<bitRange>[2:2]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DCDC_P_SW_STATE</name>
	<description>DCDC state machine PSW output</description>
	<bitRange>[1:1]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DCDC_STARTUP_COMPLETE</name>
	<description>Indicates if the converter is enabled and the startup counter has expired (internal biasing settled)</description>
	<bitRange>[0:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>DCDC_STATUS2_REG</name>
	<description>DCDC Second Status Register</description>
	<addressOffset>0x00000024</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00840084</resetValue>
	<resetMask>0x03ffffff</resetMask>
	<fields><field>
	<name>DCDC_V18P_CUR_LIM</name>
	<description>Actual V18P current limit</description>
	<bitRange>[25:21]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DCDC_V18_CUR_LIM</name>
	<description>Actual V18 current limit</description>
	<bitRange>[20:16]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DCDC_VDD_CUR_LIM</name>
	<description>Actual VDD current limit</description>
	<bitRange>[9:5]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DCDC_V14_CUR_LIM</name>
	<description>Actual V14 current limit</description>
	<bitRange>[4:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>DCDC_STATUS3_REG</name>
	<description>DCDC Third Status Register</description>
	<addressOffset>0x00000028</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x02080208</resetValue>
	<resetMask>0x0fffffff</resetMask>
	<fields><field>
	<name>DCDC_V18P_N_COMP_TRIM</name>
	<description>Actual V18P N side comparator trim value</description>
	<bitRange>[27:22]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DCDC_V18_N_COMP_TRIM</name>
	<description>Actual V18 N side comparator trim value</description>
	<bitRange>[21:16]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DCDC_VDD_N_COMP_TRIM</name>
	<description>Actual VDD N side comparator trim value</description>
	<bitRange>[11:6]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DCDC_V14_N_COMP_TRIM</name>
	<description>Actual V14 N side comparator trim value</description>
	<bitRange>[5:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>DCDC_STATUS4_REG</name>
	<description>DCDC Fourth Status Register</description>
	<addressOffset>0x0000002c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000fff</resetMask>
	<fields><field>
	<name>DCDC_CHARGE_REG_3</name>
	<description>Charge register position 3</description>
	<bitRange>[11:9]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DCDC_CHARGE_REG_2</name>
	<description>Charge register position 2</description>
	<bitRange>[8:6]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DCDC_CHARGE_REG_1</name>
	<description>Charge register position 1</description>
	<bitRange>[5:3]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DCDC_CHARGE_REG_0</name>
	<description>Charge register position 0</description>
	<bitRange>[2:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>DCDC_TEST_REG</name>
	<description>DCDC Test Register</description>
	<addressOffset>0x0000001c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x1fffffff</resetMask>
	<fields><field>
	<name>DCDC_TEST_OUT</name>
	<description>Selects which register appears on the test mode pins
0 = None
1 = DCDC_STATUS_1 High Bits
2 = DCDC_STATUS_1 Low Bits
3 = DCDC_STATUS_2 High Bits
4 = DCDC_STATUS_2 Low Bits
5 = DCDC_STATUS_3 High Bits
6 = DCDC_STATUS_3 Low Bits
7 = DCDC_STATUS_4 Low Bits
8-F = Reserved</description>
	<bitRange>[28:25]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_FORCE_CUR_LIM_VAL</name>
	<description>Current limit setting when forced</description>
	<bitRange>[24:20]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_FORCE_COMP_CLK_VAL</name>
	<description>Sets clock lines for the output comparators</description>
	<bitRange>[19:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_FORCE_CUR_LIM</name>
	<description>Force output current setting</description>
	<bitRange>[15:15]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_FORCE_COMP_CLK</name>
	<description>Disables automatic comparator clock, clock lines values based on FORCE_COMP_CLK_VAL</description>
	<bitRange>[14:14]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_OUTPUT_MON</name>
	<description>Output monitor switch (connect to ADC)
000 = None
001 = VDD
010 = V18
011 = V14
100 = V18P
101 = V18F
110 = None
111 = None</description>
	<bitRange>[13:11]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_ANA_TEST</name>
	<description>Analog test bus
000 = None
001 = High side ground
010 = Low side supply
011 = Bootstrap voltage
100 = 1.0 V buffer output
101 = None
110 = None
111 = None</description>
	<bitRange>[10:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_FORCE_IDLE</name>
	<description>Force idle mode</description>
	<bitRange>[7:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_FORCE_V18P_SW</name>
	<description>Force V18P switch on</description>
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_FORCE_VDD_SW</name>
	<description>Force VDD switch on</description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_FORCE_V18_SW</name>
	<description>Force V18 switch on</description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_FORCE_V14_SW</name>
	<description>Force V14 switch on</description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_FORCE_FW_SW</name>
	<description>Force FW switch on</description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_FORCE_N_SW</name>
	<description>Force N switch on</description>
	<bitRange>[1:1]</bitRange>
