nguyentri/da-pac/svd/DA14699.svd
	<access>read-write</access>
	</field><field>
	<name>DCDC_FORCE_P_SW</name>
	<description>Force P switch on</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>DCDC_V14_REG</name>
	<description>DCDC V14 Control Register</description>
	<addressOffset>0x0000000c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x034c4243</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>DCDC_V14_FAST_RAMPING</name>
	<description>Fast current ramping (improves response time at the cost of more ripple)</description>
	<bitRange>[31:31]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_V14_TRIM</name>
	<description>Output voltage trim
Steps of 25 mV</description>
	<bitRange>[27:27]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_V14_CUR_LIM_MAX_HV</name>
	<description>Mximum current limit (high battery voltage mode)
I = 30 mA * (1 + N)</description>
	<bitRange>[26:22]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_V14_CUR_LIM_MAX_LV</name>
	<description>Maximum current limit (low battery voltage mode)
I = 30 mA * (1 + N)</description>
	<bitRange>[21:17]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_V14_CUR_LIM_MIN</name>
	<description>Minimum current limit
I = 30 mA * (1 + N)</description>
	<bitRange>[16:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_V14_IDLE_HYST</name>
	<description>Idle time hysteresis
0 - 3875 ns, 125 ns step size
IDLE_MAX = IDLE_MIN + IDLE_HYST
Maximum idle time before decreasing CUR_LIM</description>
	<bitRange>[11:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_V14_IDLE_MIN</name>
	<description>Minimum idle time
0 - 3875 ns, 125 ns step size
Minimum idle time, CUR_LIM is increased if this limit is not reached</description>
	<bitRange>[6:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_V14_ENABLE_HV</name>
	<description>Output enable (high battery voltage mode)
0 = Disabled
1 = Enabled</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_V14_ENABLE_LV</name>
	<description>Output enable (low battery voltage mode)
0 = Disabled
1 = Enabled</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>DCDC_V18P_REG</name>
	<description>DCDC V18P Control Register</description>
	<addressOffset>0x00000018</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x47fe4242</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>DCDC_V18P_FAST_RAMPING</name>
	<description>Fast current ramping (improves response time at the cost of more ripple)</description>
	<bitRange>[31:31]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_V18P_TRIM</name>
	<description>Output voltage trim
Steps of 25 mV</description>
	<bitRange>[30:27]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_V18P_CUR_LIM_MAX_HV</name>
	<description>Maximum current limit (high battery voltage mode)
I = 30 mA * (1 + N)</description>
	<bitRange>[26:22]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_V18P_CUR_LIM_MAX_LV</name>
	<description>Maximum current limit (low battery voltage mode)
I = 30 mA * (1 + N)</description>
	<bitRange>[21:17]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_V18P_CUR_LIM_MIN</name>
	<description>Minimum current limit
I = 30 mA * (1 + N)</description>
	<bitRange>[16:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_V18P_IDLE_HYST</name>
	<description>Idle time hysteresis
0 - 3875 ns, 125 ns step size
IDLE_MAX = IDLE_MIN + IDLE_HYST
Maximum idle time before decreasing CUR_LIM</description>
	<bitRange>[11:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_V18P_IDLE_MIN</name>
	<description>Minimum idle time
0 - 3875 ns, 125 ns step size
Minimum idle time, CUR_LIM is increased if this limit is not reached</description>
	<bitRange>[6:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_V18P_ENABLE_HV</name>
	<description>Output enable (high battery voltage mode)
0 = Disabled
1 = Enabled</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_V18P_ENABLE_LV</name>
	<description>Output enable (low battery voltage mode)
0 = Disabled
1 = Enabled</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>DCDC_V18_REG</name>
	<description>DCDC V18 Control Register</description>
	<addressOffset>0x00000014</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x47fe4242</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>DCDC_V18_FAST_RAMPING</name>
	<description>Fast current ramping (improves response time at the cost of more ripple)</description>
	<bitRange>[31:31]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_V18_TRIM</name>
	<description>Output voltage trim
Steps of 25 mV</description>
	<bitRange>[30:27]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_V18_CUR_LIM_MAX_HV</name>
	<description>Maximum current limit (high battery voltage mode)
I = 30 mA * (1 + N)</description>
	<bitRange>[26:22]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_V18_CUR_LIM_MAX_LV</name>
	<description>Maximum current limit (low battery voltage mode)
I = 30 mA * (1 + N)</description>
	<bitRange>[21:17]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_V18_CUR_LIM_MIN</name>
	<description>Minimum current limit
I = 30 mA * (1 + N)</description>
	<bitRange>[16:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_V18_IDLE_HYST</name>
	<description>Idle time hysteresis
0 - 3875 ns, 125 ns step size
IDLE_MAX = IDLE_MIN + IDLE_HYST
Maximum idle time before decreasing CUR_LIM</description>
	<bitRange>[11:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_V18_IDLE_MIN</name>
	<description>Minimum idle time
0 - 3875 ns, 125 ns step size
Minimum idle time, CUR_LIM is increased if this limit is not reached</description>
	<bitRange>[6:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_V18_ENABLE_HV</name>
	<description>Output enable (high battery voltage mode)
0 = Disabled
1 = Enabled</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_V18_ENABLE_LV</name>
	<description>Output enable (low battery voltage mode)
0 = Disabled
1 = Enabled</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>DCDC_VDD_REG</name>
	<description>DCDC VDD Control Register</description>
	<addressOffset>0x00000010</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x261a4243</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>DCDC_VDD_FAST_RAMPING</name>
	<description>Fast current ramping (improves response time at the cost of more ripple)</description>
	<bitRange>[31:31]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_VDD_TRIM</name>
	<description>Output voltage trim
Steps of 25 mV</description>
	<bitRange>[29:27]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_VDD_CUR_LIM_MAX_HV</name>
	<description>Maximum current limit (high battery voltage mode)
I = 30 mA * (1 + N)</description>
	<bitRange>[26:22]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_VDD_CUR_LIM_MAX_LV</name>
	<description>Maximum current limit (low battery voltage mode)
I = 30 mA * (1 + N)</description>
	<bitRange>[21:17]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_VDD_CUR_LIM_MIN</name>
	<description>Minimum current limit
I = 30 mA * (1 + N)</description>
	<bitRange>[16:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_VDD_IDLE_HYST</name>
	<description>Idle time hysteresis
0 - 3875 ns, 125 ns step size
IDLE_MAX = IDLE_MIN + IDLE_HYST
Maximum idle time before decreasing CUR_LIM</description>
	<bitRange>[11:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_VDD_IDLE_MIN</name>
	<description>Minimum idle time
0 - 3875 ns, 125 ns step size
Minimum idle time, CUR_LIM is increased if this limit is not reached</description>
	<bitRange>[6:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_VDD_ENABLE_HV</name>
	<description>Output enable (high battery voltage mode)
0 = Disabled
1 = Enabled</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_VDD_ENABLE_LV</name>
	<description>Output enable (low battery voltage mode)
0 = Disabled
1 = Enabled</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>DMA</name>
	<version>1.0</version>
	<description>DMA registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x50040800</baseAddress>
	<size>0</size>
	<addressBlock>
	<offset>0</offset>
	<size>272</size>
	<usage>registers</usage>
</addressBlock>
	
