nguyentri/da-pac/svd/DA14699.svd
	<bitRange>[20:20]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DFT_FORCE_HSPN</name>
	<description>Force HSP and HSN power FETs on:
0: not actived
1: HSP and HSN are forced on</description>
	<bitRange>[19:19]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DFT_EN_TIMER</name>
	<description>Enable for the timer trimming</description>
	<bitRange>[18:18]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DFT_STALL</name>
	<description>Force state machine in a certain state:
00: No test
01: High-Z
10: Mag
11: Demag</description>
	<bitRange>[17:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DFT_CTRL</name>
	<description>Selection of test bus connection</description>
	<bitRange>[15:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>LRA_FLT_COEF1_REG</name>
	<description>LRA Filter Coefficient Register</description>
	<addressOffset>0x0000002c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x019a0e66</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>FLT_COEF_01</name>
	<description>Loop filter state-space coefficient a12 (1 sign bit, 1 integer bit, 14 fractional bits, range -2.000 .. +1.999).</description>
	<bitRange>[31:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>FLT_COEF_00</name>
	<description>Loop filter state-space coefficient a11 (1 sign bit, 1 integer bit, 14 fractional bits, range -2.000 .. +1.999).</description>
	<bitRange>[15:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>LRA_FLT_COEF2_REG</name>
	<description>LRA Filter Coefficient Register</description>
	<addressOffset>0x00000030</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x0e660f3e</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>FLT_COEF_10</name>
	<description>Loop filter state-space coefficient a21 (1 sign bit, 1 integer bit, 14 fractional bits, range -2.000 .. +1.999).</description>
	<bitRange>[31:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>FLT_COEF_02</name>
	<description>Loop filter state-space coefficient b1 (1 sign bit, 1 integer bit, 14 fractional bits, range -2.000 .. +1.999).
Note: For correct intended loop gain, modify the intended value of b1 to b1/ADC_GAIN, where
ADC_GAIN is the normalized gain of the ADC (i.e. ADC_GAIN = GP_ADC_VALUE&#180;300 mA/[ILRA&#180;128]).</description>
	<bitRange>[15:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>LRA_FLT_COEF3_REG</name>
	<description>LRA Filter Coefficient Register</description>
	<addressOffset>0x00000034</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x16ce019a</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>FLT_COEF_12</name>
	<description>Loop filter state-space coefficient b2 (1 sign bit, 1 integer bit, 14 fractional bits, range -2.000 .. +1.999).
Note: For correct intended loop gain, modify the intended value of b1 to b1/ADC_GAIN, where
ADC_GAIN is the normalized gain of the ADC (i.e. ADC_GAIN = GP_ADC_VALUE&#180;300 mA/[ILRA&#180;128]).</description>
	<bitRange>[31:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>FLT_COEF_11</name>
	<description>Loop filter state-space coefficient a22 (1 sign bit, 1 integer bit, 14 fractional bits, range -2.000 .. +1.999).</description>
	<bitRange>[15:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>LRA_FLT_SMP1_REG</name>
	<description>LRA Sample Register</description>
	<addressOffset>0x0000000c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>LRA_SMP_2</name>
	<description>Second sample in first half-cycle used for resonance control algorithm.</description>
	<bitRange>[31:16]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>LRA_SMP_1</name>
	<description>First sample in first half-cycle used for resonance control algorithm.</description>
	<bitRange>[15:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>LRA_FLT_SMP2_REG</name>
	<description>LRA Sample Register</description>
	<addressOffset>0x00000010</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>LRA_SMP_4</name>
	<description>Fourth sample in first half-cycle used for resonance control algorithm.</description>
	<bitRange>[31:16]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>LRA_SMP_3</name>
	<description>Third sample in first half-cycle used for resonance control algorithm.</description>
	<bitRange>[15:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>LRA_FLT_SMP3_REG</name>
	<description>LRA Sample Register</description>
	<addressOffset>0x00000014</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>LRA_SMP_6</name>
	<description>Sixth sample in first half-cycle used for resonance control algorithm.</description>
	<bitRange>[31:16]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>LRA_SMP_5</name>
	<description>Fifth sample in first half-cycle used for resonance control algorithm.</description>
	<bitRange>[15:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>LRA_FLT_SMP4_REG</name>
	<description>LRA Sample Register</description>
	<addressOffset>0x00000018</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>LRA_SMP_8</name>
	<description>Eighth sample in first half-cycle used for resonance control algorithm.</description>
	<bitRange>[31:16]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>LRA_SMP_7</name>
	<description>Seventh sample in first half-cycle used for resonance control algorithm.</description>
	<bitRange>[15:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>LRA_FLT_SMP5_REG</name>
	<description>LRA Sample Register</description>
	<addressOffset>0x0000001c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>LRA_SMP_10</name>
	<description>Second sample in second half-cycle used for resonance control algorithm.</description>
	<bitRange>[31:16]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>LRA_SMP_9</name>
	<description>First sample in second half-cycle used for resonance control algorithm.</description>
	<bitRange>[15:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>LRA_FLT_SMP6_REG</name>
	<description>LRA Sample Register</description>
	<addressOffset>0x00000020</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>LRA_SMP_12</name>
	<description>Fourth sample in second half-cycle used for resonance control algorithm.</description>
	<bitRange>[31:16]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>LRA_SMP_11</name>
	<description>Third sample in second half-cycle used for resonance control algorithm.</description>
	<bitRange>[15:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>LRA_FLT_SMP7_REG</name>
	<description>LRA Sample Register</description>
	<addressOffset>0x00000024</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>LRA_SMP_14</name>
	<description>Sixth sample in second half-cycle used for resonance control algorithm.</description>
	<bitRange>[31:16]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>LRA_SMP_13</name>
	<description>Fifth sample in second half-cycle used for resonance control algorithm.</description>
	<bitRange>[15:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>LRA_FLT_SMP8_REG</name>
	<description>LRA Sample Register</description>
	<addressOffset>0x00000028</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>LRA_SMP_16</name>
	<description>Eighth sample in second half-cycle used for resonance control algorithm.</description>
	<bitRange>[31:16]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>LRA_SMP_15</name>
	<description>Seventh sample in second half-cycle used for resonance control algorithm.</description>
	<bitRange>[15:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>LRA_LDO_REG</name>
	<description>LRA LDO Regsiter</description>
	<addressOffset>0x00000054</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>LDO_OK</name>
	<description>0: LDO not yet ok
1: LDO voltage is ready</description>
	<bitRange>[31:31]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>LDO_TST</name>
	<description>When set to 1, LDO output is connected to the testbus through a test switch</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LDO_VREF_HOLD</name>
	<description>0: Indicates that the reference input is tracked,
1: Indicates that the reference input is sampled</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>MEMCTRL</name>
	<version>1.0</version>
	<description>MEMCTRL registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x50050000</baseAddress>
	<size>0</size>
	<addressBlock>
	<offset>0</offset>
	<size>128</size>
	<usage>registers</usage>
</addressBlock>
	
