nguyentri/da-pac/svd/DA14699.svd
	<registers>
	<register>
	<name>SDADC_CLEAR_INT_REG</name>
	<description>Sigma Delta ADC Clear Interrupt Register</description>
	<addressOffset>0x00000014</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>SDADC_CLR_INT</name>
	<description>Writing any value to this register will clear the ADC_INT interrupt. Reading returns 0. </description>
	<bitRange>[15:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>SDADC_CTRL_REG</name>
	<description>Sigma Delta ADC Control Register</description>
	<addressOffset>0x00000000</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0003ffff</resetMask>
	<fields><field>
	<name>SDADC_DMA_EN</name>
	<description>0: DMA functionality disabled
1: DMA functionality enabled</description>
	<bitRange>[17:17]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SDADC_MINT</name>
	<description>0: Disable (mask) SDADC_ADC_INT.
1: Enable SDADC_ADC_INT to ICU.</description>
	<bitRange>[16:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SDADC_INT</name>
	<description>1: AD conversion ready and has generated an interrupt. Must be cleared by writing any value to SDADC_CLEAR_INT_REG.</description>
	<bitRange>[15:15]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>SDADC_LDO_OK</name>
	<description>1: Internal LDO is ready for use</description>
	<bitRange>[14:14]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>SDADC_VREF_SEL</name>
	<description>0: Internal bandgap reference.
1: External reference.</description>
	<bitRange>[13:13]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SDADC_CONT</name>
	<description>0: Manual ADC mode, a single result will be generated after setting the SDADC_START bit.
1: Continuous ADC mode, new ADC results will be constantly stored in SDADC_RESULT_REG. Still SDADC_START has to be set to start the execution. Wait for SDADC_START to become zero after clearing the SDADC_CONT bit to stop the continuous mode.</description>
	<bitRange>[12:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SDADC_OSR</name>
	<description>Oversample Rate
0: 128x
1: 256x
2: 512x
3: 1024x</description>
	<bitRange>[11:10]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SDADC_SE</name>
	<description>0: Differential mode
1: Single ended mode (Input selection negative side is ignored)</description>
	<bitRange>[9:9]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SDADC_INN_SEL</name>
	<description>Input selection of negative side.
0: ADC0 / P1[09]
1: ADC1 / P0[25]
2: ADC2 / P0[08]
3: ADC3 / P0[09]
4: ADC4 / P1[14]
5: ADC5 / P1[20]
6: ADC6 / P1[21]
7: ADC7 / P1[22]</description>
	<bitRange>[8:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SDADC_INP_SEL</name>
	<description>Input selection of positive side.
0: ADC0 / P1[09]
1: ADC1 / P0[25]
2: ADC2 / P0[08]
3: ADC3 / P0[09]
4: ADC4 / P1[14]
5: ADC5 / P1[20]
6: ADC6 / P1[21]
7: ADC7 / P1[22]
8: VBAT (via 4x attenuator, INN connected to ground)</description>
	<bitRange>[5:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SDADC_START</name>
	<description>0: ADC conversion ready.
1: If a 1 is written, the ADC starts a conversion. After the conversion this bit will be set to 0 and the SDADC_INT bit will be set. It is not allowed to write this bit while it is not (yet) zero.</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SDADC_EN</name>
	<description>0: LDO is off and ADC is disabled.
1: LDO, bias currents and modulator are enabled.</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>SDADC_GAIN_CORR_REG</name>
	<description>Sigma Delta ADC Gain Correction Register</description>
	<addressOffset>0x0000000c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields><field>
	<name>SDADC_GAIN_CORR</name>
	<description>Gain adjust</description>
	<bitRange>[9:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>SDADC_OFFS_CORR_REG</name>
	<description>Sigma Delta ADC Offset Correction Register</description>
	<addressOffset>0x00000010</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields><field>
	<name>SDADC_OFFS_CORR</name>
	<description>Offset adjust</description>
	<bitRange>[9:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>SDADC_RESULT_REG</name>
	<description>Sigma Delta ADC Result Register</description>
	<addressOffset>0x00000018</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>SDADC_VAL</name>
	<description>Returns up to 16 bits linear value of the last AD conversion. The effective resolution depends on the OSR used.</description>
	<bitRange>[15:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>SMOTOR</name>
	<version>1.0</version>
	<description>SMOTOR registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x50030e00</baseAddress>
	<size>0</size>
	<addressBlock>
	<offset>0</offset>
	<size>132</size>
	<usage>registers</usage>
</addressBlock>
	
	<registers>
	<register>
	<name>CMD_TABLE_BASE</name>
	<description>Base address of the command table</description>
	<addressOffset>0x00000080</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>CMD_TABLE_BASE_X</name>
	<description>Dummy field for register test generation.</description>
	<bitRange>[31:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>PG0_CTRL_REG</name>
	<description>Pattern generator 0 control register</description>
	<addressOffset>0x00000004</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000fe4</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>GENEND_IRQ_EN</name>
	<description>Determines if the corresponding pattern generator will contribute to the generation of the IRQ when it is done generating a pattern. It is only valid if SMOTOR_GENEND_IRQ_EN is enabled:
0 = Interrupt requests disabled
1 = Interrupt requests enabled</description>
	<bitRange>[15:15]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>GENSTART_IRQ_EN</name>
	<description>Determines if the corresponding pattern generator will contribute to the generation of the IRQ when it starts generating a pattern. It is only valid if SMOTOR_GENSTART_IRQ_EN is enabled:
0 = Interrupt requests disabled
1 = Interrupt requests enabled</description>
	<bitRange>[14:14]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PG_START_MODE</name>
	<description>0 = Auto start mode: pattern generator will start whenever all enabled signals have received a command
1 = Manual start mode: pattern generator will only start if it has been given a PG_START, and all enabled signals have received a command</description>
	<bitRange>[13:13]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PG_MODE</name>
	<description>0 = Flex mode
1 = Pair mode</description>
	<bitRange>[12:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SIG3_EN</name>
	<description>0 = Signal disabled
1 = Signal enabled</description>
	<bitRange>[11:11]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SIG2_EN</name>
	<description>0 = Signal disabled
1 = Signal enabled</description>
	<bitRange>[10:10]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SIG1_EN</name>
	<description>0 = Signal disabled
1 = Signal enabled</description>
	<bitRange>[9:9]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SIG0_EN</name>
	<description>0 = Signal disabled
1 = Signal enabled</description>
	<bitRange>[8:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>OUT3_SIG</name>
	<description>Selects which signal is routed to the output.</description>
	<bitRange>[7:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>OUT2_SIG</name>
	<description>Selects which signal is routed to the output.</description>
	<bitRange>[5:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>OUT1_SIG</name>
	<description>Selects which signal is routed to the output.</description>
	<bitRange>[3:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>OUT0_SIG</name>
	<description>Selects which signal is routed to the output.</description>
	<bitRange>[1:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>PG1_CTRL_REG</name>
	<description>Pattern generator 1 control register</description>
	<addressOffset>0x00000008</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000fe4</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>GENEND_IRQ_EN</name>
	<description>Determines if the corresponding pattern generator will contribute to the generation of the IRQ when it is done generating a pattern. It is only valid if SMOTOR_GENEND_IRQ_EN is enabled:
0 = Interrupt requests disabled
1 = Interrupt requests enabled</description>
	<bitRange>[15:15]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>GENSTART_IRQ_EN</name>
	<description>Determines if the corresponding pattern generator will contribute to the generation of the IRQ when it starts generating a pattern. It is only valid if SMOTOR_GENSTART_IRQ_EN is enabled:
0 = Interrupt requests disabled
1 = Interrupt requests enabled</description>
	<bitRange>[14:14]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PG_START_MODE</name>
	<description>0 = Auto start mode: pattern generator will start whenever all enabled signals have received a command
1 = Manual start mode: pattern generator will only start if it has been given a PG_START, and all enabled signals have received a command</description>
	<bitRange>[13:13]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PG_MODE</name>
	<description>0 = Flex mode
1 = Pair mode</description>
	<bitRange>[12:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SIG3_EN</name>
	<description>0 = Signal disabled
1 = Signal enabled</description>
	<bitRange>[11:11]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SIG2_EN</name>
	<description>0 = Signal disabled
1 = Signal enabled</description>
	<bitRange>[10:10]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SIG1_EN</name>
	<description>0 = Signal disabled
1 = Signal enabled</description>
	<bitRange>[9:9]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SIG0_EN</name>
	<description>0 = Signal disabled
1 = Signal enabled</description>
	<bitRange>[8:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>OUT3_SIG</name>
	<description>Selects which signal is routed to the output.</description>
	<bitRange>[7:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>OUT2_SIG</name>
	<description>Selects which signal is routed to the output.</description>
	<bitRange>[5:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>OUT1_SIG</name>
	<description>Selects which signal is routed to the output.</description>
	<bitRange>[3:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>OUT0_SIG</name>
	<description>Selects which signal is routed to the output.</description>
	<bitRange>[1:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>PG2_CTRL_REG</name>
	<description>Pattern generator 2 control register</description>
	<addressOffset>0x0000000c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000fe4</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>GENEND_IRQ_EN</name>
	<description>Determines if the corresponding pattern generator will contribute to the generation of the IRQ when it is done generating a pattern. It is only valid if SMOTOR_GENEND_IRQ_EN is enabled:
0 = Interrupt requests disabled
1 = Interrupt requests enabled</description>
	<bitRange>[15:15]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>GENSTART_IRQ_EN</name>
	<description>Determines if the corresponding pattern generator will contribute to the generation of the IRQ when it starts generating a pattern. It is only valid if SMOTOR_GENSTART_IRQ_EN is enabled:
0 = Interrupt requests disabled
1 = Interrupt requests enabled</description>
	<bitRange>[14:14]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PG_START_MODE</name>
	<description>0 = Auto start mode: pattern generator will start whenever all enabled signals have received a command
1 = Manual start mode: pattern generator will only start if it has been given a PG_START, and all enabled signals have received a command</description>
	<bitRange>[13:13]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PG_MODE</name>
	<description>0 = Flex mode
1 = Pair mode</description>
	<bitRange>[12:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SIG3_EN</name>
	<description>0 = Signal disabled
1 = Signal enabled</description>
	<bitRange>[11:11]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SIG2_EN</name>
	<description>0 = Signal disabled
1 = Signal enabled</description>
	<bitRange>[10:10]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SIG1_EN</name>
	<description>0 = Signal disabled
1 = Signal enabled</description>
	<bitRange>[9:9]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SIG0_EN</name>
	<description>0 = Signal disabled
1 = Signal enabled</description>
	<bitRange>[8:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>OUT3_SIG</name>
	<description>Selects which signal is routed to the output.</description>
	<bitRange>[7:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>OUT2_SIG</name>
	<description>Selects which signal is routed to the output.</description>
	<bitRange>[5:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>OUT1_SIG</name>
	<description>Selects which signal is routed to the output.</description>
	<bitRange>[3:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>OUT0_SIG</name>
	<description>Selects which signal is routed to the output.</description>
	<bitRange>[1:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>PG3_CTRL_REG</name>
	<description>Pattern generator 3 control register</description>
	<addressOffset>0x00000010</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000fe4</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>GENEND_IRQ_EN</name>
	<description>Determines if the corresponding pattern generator will contribute to the generation of the IRQ when it is done generating a pattern. It is only valid if SMOTOR_GENEND_IRQ_EN is enabled:
0 = Interrupt requests disabled
1 = Interrupt requests enabled</description>
	<bitRange>[15:15]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>GENSTART_IRQ_EN</name>
	<description>Determines if the corresponding pattern generator will contribute to the generation of the IRQ when it starts generating a pattern. It is only valid if SMOTOR_GENSTART_IRQ_EN is enabled:
0 = Interrupt requests disabled
1 = Interrupt requests enabled</description>
	<bitRange>[14:14]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PG_START_MODE</name>
	<description>0 = Auto start mode: pattern generator will start whenever all enabled signals have received a command
1 = Manual start mode: pattern generator will only start if it has been given a PG_START, and all enabled signals have received a command</description>
	<bitRange>[13:13]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PG_MODE</name>
	<description>0 = Flex mode
1 = Pair mode</description>
	<bitRange>[12:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SIG3_EN</name>
	<description>0 = Signal disabled
1 = Signal enabled</description>
	<bitRange>[11:11]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SIG2_EN</name>
	<description>0 = Signal disabled
1 = Signal enabled</description>
	<bitRange>[10:10]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SIG1_EN</name>
	<description>0 = Signal disabled
1 = Signal enabled</description>
	<bitRange>[9:9]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SIG0_EN</name>
	<description>0 = Signal disabled
1 = Signal enabled</description>
	<bitRange>[8:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>OUT3_SIG</name>
	<description>Selects which signal is routed to the output.</description>
	<bitRange>[7:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>OUT2_SIG</name>
	<description>Selects which signal is routed to the output.</description>
	<bitRange>[5:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>OUT1_SIG</name>
	<description>Selects which signal is routed to the output.</description>
	<bitRange>[3:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>OUT0_SIG</name>
	<description>Selects which signal is routed to the output.</description>
	<bitRange>[1:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>PG4_CTRL_REG</name>
	<description>Pattern generator 4 control register</description>
	<addressOffset>0x00000014</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000fe4</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>GENEND_IRQ_EN</name>
	<description>Determines if the corresponding pattern generator will contribute to the generation of the IRQ when it is done generating a pattern. It is only valid if SMOTOR_GENEND_IRQ_EN is enabled:
0 = Interrupt requests disabled
1 = Interrupt requests enabled</description>
	<bitRange>[15:15]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>GENSTART_IRQ_EN</name>
	<description>Determines if the corresponding pattern generator will contribute to the generation of the IRQ when it starts generating a pattern. It is only valid if SMOTOR_GENSTART_IRQ_EN is enabled:
0 = Interrupt requests disabled
1 = Interrupt requests enabled</description>
	<bitRange>[14:14]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PG_START_MODE</name>
	<description>0 = Auto start mode: pattern generator will start whenever all enabled signals have received a command
1 = Manual start mode: pattern generator will only start if it has been given a PG_START, and all enabled signals have received a command</description>
	<bitRange>[13:13]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PG_MODE</name>
	<description>0 = Flex mode
1 = Pair mode</description>
	<bitRange>[12:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SIG3_EN</name>
	<description>0 = Signal disabled
1 = Signal enabled</description>
	<bitRange>[11:11]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SIG2_EN</name>
	<description>0 = Signal disabled
1 = Signal enabled</description>
	<bitRange>[10:10]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SIG1_EN</name>
	<description>0 = Signal disabled
1 = Signal enabled</description>
	<bitRange>[9:9]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SIG0_EN</name>
	<description>0 = Signal disabled
1 = Signal enabled</description>
	<bitRange>[8:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>OUT3_SIG</name>
	<description>Selects which signal is routed to the output.</description>
	<bitRange>[7:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>OUT2_SIG</name>
	<description>Selects which signal is routed to the output.</description>
	<bitRange>[5:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>OUT1_SIG</name>
	<description>Selects which signal is routed to the output.</description>
	<bitRange>[3:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>OUT0_SIG</name>
	<description>Selects which signal is routed to the output.</description>
	<bitRange>[1:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>SMOTOR_CMD_FIFO_REG</name>
	<description>Motor control command FIFO register</description>
	<addressOffset>0x00000020</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>SMOTOR_CMD_FIFO</name>
	<description>Writing to this address will push a command into the command FIFO.</description>
	<bitRange>[15:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>SMOTOR_CMD_READ_PTR_REG</name>
	<description>Command read pointer register</description>
	<addressOffset>0x00000024</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000003f</resetMask>
	<fields><field>
	<name>SMOTOR_CMD_READ_PTR</name>
	<description>Pointer to the next command to be popped from the FIFO. The command at SMOTOR_CMD_READ_PTR-1 is the last command that has been popped from the FIFO into its corresponding PG.</description>
	<bitRange>[5:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>SMOTOR_CMD_WRITE_PTR_REG</name>
	<description>Command write pointer register</description>
	<addressOffset>0x00000028</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000003f</resetMask>
	<fields><field>
	<name>SMOTOR_CMD_WRITE_PTR</name>
	<description>Pointer to the location in the FIFO where the next command will be pushed at. The last command pushed to the FIFO is at SMOTOR_CMD_WRITE_PTR - 1. Can only be changed in cyclic mode</description>
	<bitRange>[5:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>SMOTOR_CTRL_REG</name>
	<description>Motor control register</description>
	<addressOffset>0x00000000</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x1fffffff</resetMask>
	<fields><field>
	<name>TRIG_RTC_EVENT_EN</name>
	<description>0 = RTC event does not trigger command pop
1 = RTC event triggers command pop</description>
	<bitRange>[28:28]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>MC_LP_CLK_TRIG_EN</name>
	<description>0 = Divided sleep clock does not trigger command pop
1 = Divided sleep clock triggers command pop</description>
	<bitRange>[27:27]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SMOTOR_THRESHOLD_IRQ_EN</name>
	<description>IRQ in the event of the FIFO level (write pointer - read pointer) reaching, or is below the threshold determined by SMOTOR_THRESHOLD.
0 = Interrupt requests disabled
1 = Interrupt requests enabled</description>
	<bitRange>[26:26]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SMOTOR_THRESHOLD</name>
	<description>Determines the FIFO level (write pointer - read pointer) at or below which and IRQ can be triggered using SMOTOR_THRESHOLD_IRQ_EN.</description>
	<bitRange>[25:21]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SMOTOR_FIFO_UNR_IRQ_EN</name>
	<description>IRQ in the event of FIFO underrun:
0 = Interrupt requests disabled
1 = Interrupt requests enabled</description>
	<bitRange>[20:20]</bitRange>
